[
  {
    "title": "2 Contracts in China Question",
    "url": "https://www.chinese-forums.com/forums/topic/63890-2-contracts-in-china-question/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hello,\n\n \n\nAny help anyone can offer would be very helpful.\n\nI have two competing offers in China.\n\n \n\nOne is at a college teaching English as a second language.\n\nThe second is an IB school. The IB school pays roughly twice as much as the college.\n\n \n\nI want to try and eventually teach in Hong Kong or Macao as an ESL teacher. Will I be better positioned in 2 years to apply to public schools in Hong Kong or Macao or the NET program with 2 years of ESL instruction under my belt?\n\n \n\nI have a CELTA as well as other teaching experience and qualifications.\n\n \n\nI also plan to get a PGCE, so I will also be able to apply to private schools in Hong Kong or Macao that offer IB curriculum.\n\n \n\nWhat would you all advise I do? Money in the short run is good, but I’m wondering if taking less money and the ESL experience is worth the sacrifice. I will make the money back if I get a position in Hong Kong or Macao. \n\n \n\nThanks. "
      },
      {
        "author": "Unknown",
        "content": "I know nothing about teaching but I'd choose the one with 2x pay without hesitation. Plans/situations can change in 2 years. A bird in the hand is worth two in the bush."
      },
      {
        "author": "Unknown",
        "content": "I also dont know anything about teaching, but international school teachers earn a lot more money than English language teachers (not just in China). So even in Hong Kong or Macao, finding a job as an international school teacher might be possible. Otherwise English I guess is always still an option? I know a lot of English teachers who want to start teaching at international schools. I have never met an international school teacher who was aspiring to become an English teacher again."
      }
    ],
    "num_posts": 3
  },
  {
    "title": "Teaching visa and a criminal record",
    "url": "https://www.chinese-forums.com/forums/topic/63640-teaching-visa-and-a-criminal-record/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I am considering being a subject teacher in China, and have already had a couple of interviews. I have a very unique problem, though. Basically my situation is as follows: I am originally from EU country A. I moved to EU country B a few years ago. I was working a university job for a while, but had to quit due to health reasons. I was out of work, started freelancing without knowing how to manage it. I ended up getting an accountant to take care of my local taxes, which I took care of in an organized manner. However, I forgot to inform my home country about some of the income. I thought I was only being taxed in the country of residence, but apparently I was subject to double taxation. I was accused of tax evasion, received a hefty fine and a 4 month suspended sentence. It sucked, as it really was an honest mistake, and I wasn't purposely trying to hide my income.\n\n \n\nOtherwise, my record is clean, but I am worried that this will greatly impact being able to get a teaching visa to Chin"
      }
    ],
    "num_posts": 1
  },
  {
    "title": "Alternative entry than Z visa",
    "url": "https://www.chinese-forums.com/forums/topic/62317-alternative-entry-than-z-visa/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hello, I have been already a teacher in China in 2017-18, although I was in a grey area of \"legality\" where they made me applied for the work visa and technically never processed\n\nI dont have a BA and dont plan to have one.\n\n \n\nI curious to know about the following:\n\n1) Student visa, does being a student allow you to work, can you get a student visa just from language school, does it have to be from university?\n\n2) Starting a business, I heard that from an agent, a recent \"loophole\", where you create your own business of whatever nature and its allow you to legally work too.\n\n \n\nI see so many demand and the salary is so high right now to work in China, although mostly kindergarten level, if they need so much why is the gov not reducing the requirement for those worker instead of being in constant need of them, I dont hear from a lot of BA holder willing to go in far countryside to do kindergarten or training school stuff. Like most I think they target tier 1, tier 2 city. so, they shou"
      },
      {
        "author": "Unknown",
        "content": "1) A student can take a paid internship in the field he is studying.  This doesn't mean work as an English teacher on the side.\n\n \n\n2) Even if you are a business owner, unless you have a BA you can't work for your own company.  A ton of people had the same thought and registered phony companies in Shanghai so they're quite strict about it now.  \n\n \n\n  \nOn 6/30/2022 at 8:55 AM, Siyano said:\n\nI see so many demand and the salary is so high right now to work in China\n\nReally?  Tons of people are leaving the country in disgust right now, and they just destroyed the entire after-school English training industry last year.  Wages haven't gone anywhere, schools just aren't willing to pay more than a certain amount.  I get the idea that China is transitioning into more like Taiwan or Korea, where only educational professionals can teach.  I.E. you're a career teacher in your home country before you ever set foot in China.  "
      },
      {
        "author": "Unknown",
        "content": " \n\n  Quote\n\nChina is transitioning into more like Taiwan or Korea, where only educational professionals can teach.\n\nAs above, things have changed big time since 2017-18. There are some pretty high salaries floating around but you're only going to access them if you're here already OR coming into the country fully qualified on a work visa. If you've not got a degree seems little chance in getting here to work legally at the moment. There are probably kindergartens that would take a chance if you were here ... but still a tricky situation."
      }
    ],
    "num_posts": 3
  },
  {
    "title": "2 Contracts in China Question ",
    "url": "https://www.chinese-forums.com/forums/topic/59839-2-contracts-in-china-question/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hello,\n\n \n\nAny help anyone can offer would be very helpful.\n\nI have two competing offers in China.\n\n \n\nOne is at a college teaching English as a second language.\n\nThe second is an IB school. The IB school pays roughly twice as much as the college.\n\n \n\nI want to try and eventually teach in Hong Kong or Macao as an ESL teacher. Will I be better positioned in 2 years to apply to public schools in Hong Kong or Macao or the NET program with 2 years of ESL instruction under my belt?\n\n \n\nI have a CELTA as well as other teaching experience and qualifications.\n\n \n\nI also plan to get a PGCE, so I will also be able to apply to private schools in Hong Kong or Macao that offer IB curriculum.\n\n \n\nWhat would you all advise I do? Money in the short run is good, but I’m wondering if taking less money and the ESL experience is worth the sacrifice. I will make the money back if I get a position in Hong Kong or Macao. \n\n \n\nThanks. \n\n "
      },
      {
        "author": "Unknown",
        "content": "No brainier! The IB school.\n\n \n\nIB is the currently worlds “in” curriculum. Every international school that isn't IB has plans to be or is “making their own inquiry based curriculum” (read: making it more IB like). Having 2 years of experience in an fully accredited IB school (you should check) will stand you in good stead GLOBALLY. \n \n\nIn comparison, having ESL experience in college that (likely) no one has heard of won’t look as good. \n \n\nIf you want to work in a public school (i assume elementary/middle/high) then working in an IB school will translate better to that, rather than working with older kids in college. \n \n\nAssume you’d teach EAL in the IB school? "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 4/17/2020 at 6:05 AM, ChTTay said:\n\nAssume you’d teach EAL in the IB school? \n\nThat's what I was going to ask. The IB school is the better option if you're looking for a secondary education career outside of mainland China, no doubt. But if you wouldn't be teaching English at the IB school, I can see why you'd worry the experience won't be so relevant."
      },
      {
        "author": "Unknown",
        "content": "  \nOn 4/17/2020 at 6:45 AM, roddy said:\n\nBut if you wouldn't be teaching English at the IB school, I can see why you'd worry the experience won't be so relevant.\n\nYes and no. If it’s an IB school in China then it’s bilingual or its fully English (rarer these days). in that case then, let’s say you’re the homeroom teacher, you’re responsible for your class English language development. You’d also do unit of inquiry and English math. Maybe others depending on the school. It’s all in English. \n \n\nIt might actually be BETTER to have the experience as you can see exactly what students need in their own classroom from the perspective of teaching them day to day. This is assuming you’re in elementary. If you’ve already got a good amount of EAL experience then it’s a natural transition.\n \n\nIf you’re going to the IB place to be an EAL teacher then you’d still get the IB training. You’d also work closely with homeroom to help students that qualify for EAL support. \n \n\nThe IB school is 100% the w"
      },
      {
        "author": "Unknown",
        "content": "Better go for the IB school - it’s a better career option. \n \n\nIf you get to HK after that, there won’t be any point being an NET teacher.\n\n \n\nCheck carefully on what you need to teach in HK. I think you need a diploma. "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 4/16/2020 at 8:34 PM, Jamesjj10003 said:\n\nI also plan to get a PGCE\n\nAs you’re planning to be in China I assume you mean iPGCE (the distance option). I know a fair few people who have done this. The main drawback is that it does not come with QTS. It’s just the “theory” part of a PGCE so whilst you get the certificate it doesn’t qualify you to teach in the U.K. In China, this doesn’t seem to matter most of time. Some schools here even recruit high quality candidates with the intention of them doing the iPGCE as they work. \n \n\nAnyway, the point I make is ...you can use this China but I’d check if it’s accepted in Hong Kong. It wouldn’t be accepted in the U.K. as is.\n\n \n\nHowever, you can still get QTS but It’s just a longer process. If your school doesn’t want to pay, it can also be quite expensive. You have to pay to fly someone out here for them to observe you. Otherwise, I think you can find a school in the U.K. who will let you observe and teach there for a short period. I know"
      },
      {
        "author": "Unknown",
        "content": "If you want to teach at one of the high-end international schools in Hong Kong, you might better start your career at a good international school outside the Mainland.\n\n \n\nFor better or worse, in some circles at least, \"Spent two years teaching English in China\" does not burnish your résumé much."
      },
      {
        "author": "Unknown",
        "content": "Wow that is all very helpful thank you! "
      },
      {
        "author": "Unknown",
        "content": "Would anyone have any specific recommendations for what school to get a PGCE or iPGCE from in the UK? I am interested in the QTS as well in order to make my candidacy in the future stand out. If anyone was willing to PM me on that or discuss here I would be most appreciative. "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 4/17/2020 at 3:49 PM, 889 said:\n\nFor better or worse, in some circles at least, \"Spent two years teaching English in China\"\n\nHence the IB option. "
      },
      {
        "author": "Unknown",
        "content": "I didn't intend to limit it that way.\n\n \n\nTeaching, at least in the first couple of years, is as much a learning experience for the teacher as it is for the students. Teaching in the Mainland, a teacher learns how to work with Mainland students and within all sorts of Mainland organisational and cultural parameters.\n\n \n\nThat's great preparation for somebody planning on a career teaching in the Mainland.\n\n \n\nMy point is simply that the high-end international schools in Hong Kong don't model themselves on Mainland institutions. If you're ultimately aiming to teach at one of those schools, I think you'd be better off starting your teaching career at an international school outside the Mainland, the sort of school which HK international schools consider a peer.\n\n \n\n(Note we're talking about the \"international\" schools in Hong Kong. If you're looking for a job with one of the \"patriotic\" schools, for example, then Mainland experience would probably be a plus.)"
      },
      {
        "author": "Unknown",
        "content": "OP hasn't given any further about the job so the mainland students that he may encounter (especially in IB school) may not be stereotypical 'mainland educational system style' types. For example the school may have kids who have had part of their education abroad and returned with family to China, or from other countries where English is not the Mother tongue but parents working in China."
      },
      {
        "author": "Unknown",
        "content": "But it'll nonetheless be exposure to a Mainland institution working to Mainland standards of management, culture etc. Outside the Mainland, and in some sectors of Hong Kong society in particular, that exposure is often not considered a plus. The OP should at least be aware of this."
      },
      {
        "author": "Unknown",
        "content": "  \nOn 4/18/2020 at 2:07 AM, 889 said:\n\nworking to Mainland standards of management, culture etc.\n\n \n\nThis I have some reservations in the assumption.\n\n \n\nI am guessing that mainland schools that do IB do not have many teachers who are mainland educated. The majority of the teachers and especially the heads are going to overseas expats. That's simply a result of history. Not many mainland teachers would have left early in the careers and trained as IB teachers - especially the seniors who I would expect there to be far fewer in numbers who are familiar with IB. \n\n \n\nThus , the working culture will almost definitely not be stereotypical 'mainland standard' since many of the staff will have had overseas working experience. Partially, yes, with lots of shades of grey. Whether that is or is not a plus on the OP's CV will be a moot point for getting a job in HK or Macau. It depends on luck and timing. I have seen quite a few expat teachers who travel to different countries on contracts for a"
      },
      {
        "author": "Unknown",
        "content": "No Party Secretary in the IB schools in China? \n\n \n\nTake a look at the YK Pao School, which offers an IB curriculum. Yes, they have a foreign head, but the people governing the school have all the sort of credentials you'd expect to find at a major Mainland school. If you're teaching there you learn the boundaries very quickly I'm sure, or you're not teaching there.\n\n \n\nhttps://www.ykpaoschool.cn//About-Us/Governance"
      },
      {
        "author": "Unknown",
        "content": "@Flickserve has it dead right.\n\n \n\nIt really won’t matter about where they’ve worked as long it’s an International IB school and the OP wishes to move to an international IB school. \n\nThat is the main reason why they should definitely take that job. \n \n\nEven moving to a non-IB school, having worked for 2 years in an inquiry based curriculum will be useful. Most schools are moving toward this style of curriculum regardless if they’re IB or not. \n \n\n  \nOn 4/18/2020 at 3:11 AM, 889 said:\n\nNo Party Secretary in the IB schools in China? \n\nI feel like you have a skewed idea of what international schools here are like. If you’re in education, I encourage you to visit when travel opens up. There are a lot of PD offerings based in China now as it’s the largest International school market in the world. "
      },
      {
        "author": "Unknown",
        "content": "You're missing the point.\n\n \n\nWe're talking here about how starting his career at a Mainland school may affect his career opportunities later outside the Mainland, especially in Hong Kong.\n\n \n\nWe can talk till the cows come home about the reality of the situation in Mainland schools. But that's not relevant to the point.\n\n \n\nThe point is how those outside the Mainland will view that experience when he's looking for a job. What counts then isn't the reality: it's the perception of Mainland education and the perception of those who've spent their formative teaching years in China."
      },
      {
        "author": "Unknown",
        "content": "Lots of points! ?\n \n\nWhich country the OP has taught in or teaches\n\nis very unlikely to affect it. It all depends on the type of school (IB, WASC accredited, UK curriculum etc), the quality of the school and the experience/training of the teacher. \n\n \n\nIt’s not mainland education. It’s the IB. \n \n\nIn my experience in International education I can’t see it having much influence at all if the above are all good. Unless you work in international education in Hong Kong and are telling me this from personal experience then I just can’t agree with you. "
      },
      {
        "author": "Unknown",
        "content": "That is quite a lot of info to process, thanks again. Does anyone have any personal experiences in getting the iPGCE?"
      },
      {
        "author": "Unknown",
        "content": "No, but you could check out the overseas teaching section on the TES forum.\n\n \n\nIf you want more information here, you're going to have to tell us a little more about this IB school and a little more about what you'd actually be doing there.\n\n \n\nPersonally, I'm inclined to think a school in Hong Kong will be more concerned that you have IB teaching experience, rather than where you got said IB teaching experience.  And, as with most things, the variation in quality of schools within China is more significant than the variation between China and other countries.  There are schools in Beijing and Shanghai which I'm sure top international teachers would love to have on their CV."
      }
    ],
    "num_posts": 20
  },
  {
    "title": "Lawyer Tells Me My Contract Is Unfair And Suggests I Find Another Job. Help! ",
    "url": "https://www.chinese-forums.com/forums/topic/56509-lawyer-tells-me-my-contract-is-unfair-and-suggests-i-find-another-job-help/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I met with a lawyer yesterday to go over my new contract (for the school I am currently teaching at). She said she didn't like how I am not paid for summer or winter break, there's no mention of insurance and I am not compensated for my flight. She suggests I find another job or talk to my agent if I want to keep this job... but I like this job and I dont want to leave thinking the grass is greener and I end up in a bad situation. I sent a message to my agent (the one who makes the contracts) an hour ago about 1 of the issues and she hasnt responded. (I know it's break time). \n\n \n\nWhat do you think?\n\n \n\nThanks again!"
      },
      {
        "author": "Unknown",
        "content": "Well, is the pay high enough to compensate for these drawbacks?\n\n "
      },
      {
        "author": "Unknown",
        "content": "I make 10,500 rmb a month \n\n@edelweis i am getting 6000 rmb bonus after the holiday but I am out for 4 month- January to March and  July to September \n\n \n\nwhat do you think?"
      },
      {
        "author": "Unknown",
        "content": "i think you should just look at this like any other job, if you are not happy with the conditions, look for another one. Of course conditions in China also include obtaining visa, as well as material considerations\n\nHave you signed the contract yet and if not when is it due to start (old one end)? if that is the case no reason why you can't negotiate for more favourable conditions.\n\n \n\n \n\n \n\n "
      },
      {
        "author": "Unknown",
        "content": "@DavyJonesLocker   I have not signed. The new one starts in August... but school starts in September... idk"
      },
      {
        "author": "Unknown",
        "content": "As Davy said, look at similar jobs and see what the pay and conditions are like. If they’re all better than yours then take that information to your school and ask them to meet it. If they won’t, then leave that school and go to another one. \n\n \n\nSometimes a “flight allowance” is also called a end of contract bonus or something that isn’t tied to a flight. For instance, my flight allowance requires proof that I’ve taken a flight. In the past I had a “end of contract bonus” that was really just a way to incentivise me to stay. Do you have anything at all at the end of contract?  If not, then that’s probably not the norm. Doesn’t count in favour of staying. \n\n \n\nAfter holiday bonuses are usually just to encourage you to stay. That bonus is only Just over half your wage and they don’t even pay you during holidays. \n\n \n\nWhat kind of school do you work in? Universities and some public schools\n\nwont pay you over the holiday and isn’t that uncommon. The trade off is a lot of holiday and they "
      },
      {
        "author": "Unknown",
        "content": "@ChTTay  i work in a private school. I'm getting business insurance.\n\n \n\nother schools' pay are about the same as mine or a little more but im not paying for housing or utilities.\n\n \n\n \n\ni dont see anything at the end of the contract"
      },
      {
        "author": "Unknown",
        "content": "I'd say its no harm in looking around and that way you can compare contracts. You don't have to take any offers but it gives you bargining power \n\nIts how i got most of my pay rises "
      },
      {
        "author": "Unknown",
        "content": "@DavyJonesLocker  so, it's normal to not be paid during break?  The agent isn't budging. Also, what is business insurance?"
      },
      {
        "author": "Unknown",
        "content": "Seems like you don’t want to leave. Just compare and negotiate a bit. Done "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 5/15/2018 at 3:13 AM, Pianote said:\n\nso, it's normal to not be paid during break?  The agent isn't budging. Also, what is business insurance?\n\n \n\nno idea about your career sorry Pianote, my posts are more based on experience of dealing with various jobs in difference countries as both an employee and employer. \n\ni think your focus should be on how you can negotiate any benefits , the fairness doesn't come into it as its a free market. \n\n \n\n "
      },
      {
        "author": "Unknown",
        "content": "Careful. If you start asking to be paid for the holidays, they'll find a way to make you work the holidays. Fancy getting sent to a badly organised summer camp?\n\n \n\nGiven that you seem happy there, I'd stick with it. Maybe ask for a small increase, as you're now more experienced and it'd be a hassle for them to bring in a new teacher. But I wouldn't risk any major demands."
      },
      {
        "author": "Unknown",
        "content": "@roddy  so true. Im definitely not trying to work during the break. Hell no. I was given a 500 rmb increase a month for next semester."
      },
      {
        "author": "Unknown",
        "content": "  \nOn 5/15/2018 at 1:07 AM, Pianote said:\n\nShe said she didn't like how I am not paid for summer or winter break, there's no mention of insurance and I am not compensated for my flight.\n\nI can see how she doesn't like that, but they don't seem like really bad issues. Now if you were liable for your students not passing the TOEFL, or were obligated to work 60 hours a week, or something unreasonable like that, then I'd advise you to leave. Or if they couldn't get you the right visa. But the issues you mention are not, as I see it, deal breakers.\n\n \n\nI think other people's advice here is good: look around at other schools and compare what you'd get there, negotiate a bit at your current school, weigh your options and then opt to stay or go. If you are happy where you are, that's also an important factor."
      },
      {
        "author": "Unknown",
        "content": "@Lu  yes my students and coworkers are very sweet and that means alot to me as I know what it's like to work with spiteful  coworkers ( I  worked in several restaurants in college).\n\n \n\nI dont grade papers and i work 4 days a week and my hours are short. My cousins are even thinking about coming to China. "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 5/15/2018 at 3:53 AM, Pianote said:\n\nMy cousins are even thinking about coming to China. \n\n \n\n \n\nGreat, that would be nice to have some family around"
      },
      {
        "author": "Unknown",
        "content": "I think you should quit and then I can have your job."
      },
      {
        "author": "Unknown",
        "content": "Do you think it'd be ok if my cousin came to stay with me for, like, a month?\n\n \n\n I know the question is similar to my couchsurfing question but I still want to know."
      },
      {
        "author": "Unknown",
        "content": "I think that should be less of a problem, since it's family, not some random person. But if your school is your landlord, or if your landlord comes by regularly, let them know your cousin is staying over."
      },
      {
        "author": "Unknown",
        "content": "Actually, after all the questions you could maybe start helping other people out - could you do a new post explaining your recruitment process, getting to the school, settling in, etc. It's actually quite rare for new teachers to have such a positive experience and it'd make a nice contrast to the usual complaints. You're welcome to name the agency if you want. "
      }
    ],
    "num_posts": 20
  },
  {
    "title": "English Contract ",
    "url": "https://www.chinese-forums.com/forums/topic/55691-english-contract/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I'm a new teacher and I've started teaching at a school in China. I'm not particularly happy with the area, the staff or the hours. I want to break my contract, but I'm afraid I won't be able to stay in China since my school sponsored me to be here. I would like to continue teaching, but in an area I enjoy. Also, if possible, less stressful and fewer hours working because I have yet to explore anything because of the workload. I am here to teach, but if that's all I'm doing then I could have stayed in my home country. I want to break the contract, but  I'm concerned about the fees I'll have to pay back. It states in the contract that I will be provided receipts of the expenses the school spent. I know I'll have to pay back the residence permit application, health check, and loan for the apartment. However, I'm concerned about the miscellaneous expenses. For instance, the hotel, taxis, salary and anything else required since my arrival. I'm also worried about the lease I signed for my a"
      },
      {
        "author": "Unknown",
        "content": "I can’t say for certain on the apartment rental, because I suspect this depends heavily on how your landlord feels.\n\n \n\nBut as for miscellaneous expenses, I suspect they will compile any receipts they have kept. This is pretty typical. I don’t think they can make you pay back your salary, but essentially they will expense everything they spent on you back to you."
      },
      {
        "author": "Unknown",
        "content": "The expenses aren’t your biggest barrier to breaking contract. What is is that your school needs to provide a letter of release that enables any new school to hire you. If you part way under bad terms, they can just not give this to you (or more often directly to the new school). This means you won’t be able to complete the process of getting a new residence permit for a new school. As far as i’m aware, leaving China and coming back doesn’t solve it either. \n\n \n\nWhat does your contract say about a notice period? If it says a month then that’s not so bad, just give your notice, have good reasons ready ( don’t say the hate the school and people etc) and start a discussion. If it’s a 3 month notice period, maybe you can come to an agreement about what you’d need to pay and when you could leave (an earlier date).\n\n \n\nIt’s likely you’d lose your deposit on the apartment if you paid it. You could probably get some rent back but again it’s a discussion and depends on the willingness of the pa"
      },
      {
        "author": "Unknown",
        "content": "Were I you, I'd make sure you get the break penalties well in hand and then start looking for new jobs. Provided you find a school that really wants you, or really needs replacement staff (teacher left in the middle of the term, for example), you may be able to get them to cover those break expenses for you. We have a teacher at our school who had this happen to him. He was well looked on in Chengdu and personally knew our CEO, and when our agency offered him a better deal on salary in the middle of the year they also offered to cover all of the breakage fees because they were in a hurry to get him to our school and get him started teaching."
      },
      {
        "author": "Unknown",
        "content": "Actually, I was in a similar situation with a crappy employer in Jiamusi. I was teaching 52 classes a week and working 13 hour days. I read my contract and talked to the US embassy. They suggested that I stick it out and then find a new job after I had completed my contract. They stated that employers have been known to get petty, vengeful and vindictive when foreign teachers just quit. So, I was faced with a decision! Quit and go home and never come back to China, as I would surely be blacklisted or any other list they use or stick it out! I chose to stick it out but I will tell you my attitude got really bad as I was so tired of being taken advantage of. I was the only employee that school had that when their contract was over did not return to their home country. I got a university teaching job and I love it! I have now been on my job for 3 years and have no plans on leaving anytime soon! So, based on  my experience, I would suggest that you ask yourself: why did you come to China? "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 1/7/2018 at 5:03 AM, Baby Charlie said:\n\nas I would surely be blacklisted\n\n \n\nThere is no blacklist. \n\n \n\nHowever, you sort of go back to the point I made that you do need a letter of release from your current employer before moving your residence permit to a new employer. \n\n \n\nIt seems like the OP doesn’t want to stick it out at all but depends how long the contract is! "
      },
      {
        "author": "Unknown",
        "content": "My contract is 15months long and honestly, I don't think I could be here for that long. How do I go about negotiating the fees? If I owe them xyz then how would it be possible to negotiate anything? If they refuse to give me a letter of release then what are my options? I am considering on going to Taiwan to try and teach. If I'm not offered a letter then would it be possible to establish residency there? Hypothetically, what would happen if I upped and vanished one day? I'm not saying I would do it, but I'm curious to know the outcome. The school has all my information (SSN & Passport number). My goals were to travel for a bit while gaining experience as a teacher and also I would like to improve my mandarin in the process. "
      },
      {
        "author": "Unknown",
        "content": "apparently there is (or was?) a govt office dedicated to sorting those things out...\n\nhttps://www.chinese-forums.com/forums/topic/49440-company-refusing-to-hand-over-release-letter/\n\nhttps://www.chinese-forums.com/forums/topic/50587-safea-helps-resolve-dispute-with-school-boss/\n\n "
      },
      {
        "author": "Unknown",
        "content": "Have you looked at your contract?\n\n \n\nIf your contract is anyway half decent it will specifically say a notice period you have to give if you want to leave. As I asked before, what’s the notice period? \n\n \n\nYou’re getting way way ahead of yourself. If the notice period is 3 months then you can decide if you can take working there for that long. \n\n \n\nDefinitely don’t do a runner. Having worked at schools where people have disappeared overnight, it’s your own students that get hit the hardest. The owners don’t care as long they’re making enough money. I had someone justify leaving as sticking it to the owner of our school but it’s just an excuse for them. The owner didn’t bat an eyelid, it just meant all their colleague (including me) had to work to cover the classes. \n\n \n\nAs for “fees” from the school, you’re breaking contract so they’re going to be some. Again, your contract should stipulate what some or most of these are. What does it say? It’s likely just visa processing.\n\n \n\nRent is"
      },
      {
        "author": "Unknown",
        "content": "My contract states a 60 day notice period. I believe I need to reimburse the school for anything processed for my visa, loan, and any expenses that were spent on me during my stay. The unknown fees scare me the most. is it true a school can blacklist you if you break a contract? My colleague told me this. "
      },
      {
        "author": "Unknown",
        "content": "As I said 3 posts previously there is no blacklist. \n\n \n\nIf the school has great contacts locally or provincially they might be able to warn other schools off hiring you or something like that BUT there is no blacklist. It’s more likely if you don’t leave on good terms then they just wouldn’t give you the release letter! \n\n \n\nIf you’re leaving the city anyway it doesn’t matter. \n\n \n\nWhat fees are you imagining here? You can pretty much guess most of them:\n\n \n\nDid you stay in a hotel at first? Look that up and see how much per night \n\nYou had a loan? How much? \n\nVisa processing fees are unlikely to be astronomical \n\n \n\nIf you’ve got 3 months rent left, give them 3 months notice instead of the contractually stated 2 months as a sign of goodwill. Come up with nice reasons why you’re leaving beyond you hate everything and you should be okay. "
      },
      {
        "author": "Unknown",
        "content": "Apologies for the late reply. I was going to try and tough it out, but I've reached my limit. The contract states some exact fees, but the main issues are the miscellaneous fees. I'm not sure if I have to pay my salary back or not. It states that the proportion of the expenses will be calculated by dividing the days not worked in the contract by the number of days in the contract term (not worked days/contract term days).  I'm still in a probationary period and haven't formally taken over any classes. However, I've taught some classes on my own. I'm not comfortable in the slightest. The staff talks poorly about me behind my back. Hardly no one talks to me and I'm constantly left in the dark. Its honestly a very toxic environment and I'm constantly unhappy. I'm very confused about what will happen if they hand over all the fees that the school has paid on my behalf and I can't afford to refund them the money. I'm in quite a bit of a predicament and apprehensive about confronting them. I"
      },
      {
        "author": "Unknown",
        "content": "I am not sure you need a valid reason as you are in a probationary period which I would understand to be probationary on both sides, you tried it,  you didn't like it, give your notice, find out how much you will have to pay, until you know,  you may be worrying  unnecessarily.\n\n \n\nIn my opinion if you don't think you can last the 15 months, then bite the bullet and get on with leaving, the longer you leave it the worse it will get. \n\n \n\nIt may all go better than you think, if they really don't like you\n\n  \nOn 1/25/2018 at 12:34 PM, MUSA90 said:\n\nThe staff talks poorly about me behind my back. Hardly no one talks to me and I'm constantly left in the dark\n\n \n\nThey might want you to go but aren't saying, I don't say this to upset you but to try and make you look at it from a different point of view.\n\nJust take a deep breath and take things one step at a time, it will work out.\n\n \n\n "
      },
      {
        "author": "Unknown",
        "content": "Its been like this since my arrival and the fact I waited this long was idiotic on my part. I was foolish to think things would get better. How do I go about locating the  SAFEA office in my general area? I'm having issues connecting to the general SAFEA website."
      },
      {
        "author": "Unknown",
        "content": "If it is really that bad, just give notice and quit and go home! China is not for everyone and it will test your strength of character in ways that most would never imagine. As I tell the whiners that come here to live and work: Thick skin get some or go home!\n\n "
      },
      {
        "author": "Unknown",
        "content": "Come up with a reason, set a meeting, give your notice. \n\n \n\nAs above, if you’ve paid up 3 months rent, say you’re happy to give them 3 months - 30 days longer - as you know it’s hard to recruit teachers. \n\n \n\nYou could just say you aren't enjoying life in the city or away from home. You want to try another part of China or travel a bit then decide. They’ll likely try persuade you  not to leave. \n\n \n\nJust get it over with but approach it with a good reason and explaination."
      },
      {
        "author": "Unknown",
        "content": "I informed the school today, but for some reason, I don't have to stay the 30 days. I  believe the fact that I'm on probation seems to be the reason why I'm free to go(it seems strange because it doesn't state that in my contract). I need to finish my weekend and I can part ways. The school is mad that I'm not finishing the remainder of my probation. However, the school told me they were going to help me find other means of work if I stayed, but I've decided to leave China. I don't understand why they would help me out. The fees are unclear as of now, so I'm not sure what will happen in the coming days. "
      },
      {
        "author": "Unknown",
        "content": "You know if you leave China you’ve gotta leave this forum too, right?\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n Glad it worked out for you "
      },
      {
        "author": "Unknown",
        "content": "They could quite possibly earn a fee by referring you on to another school. Glad things seem to be working out. "
      },
      {
        "author": "Unknown",
        "content": "Go home and regroup! You can come back in a few months! I will say this from experience that teaching children English in China is a billion dollar business! It is a dirty, cut throat business run by many heartless, greedy folks! I have found teaching at the university level one of the most rewarding jobs, I have ever had. There is a big difference in the demographics in China! Please let us know that you got home safely and good luck in the next chapter of your life!"
      }
    ],
    "num_posts": 20
  },
  {
    "title": "Can You Be Fired From Teaching English In China Simply Because You Are Black?",
    "url": "https://www.chinese-forums.com/forums/topic/55616-can-you-be-fired-from-teaching-english-in-china-simply-because-you-are-black/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I am a black woman who is an oral English teacher to 12-18 year old students at a private highschool in China. I have been teaching 2 months. All the colleagues and principals are friendly to me. The students seem to like me and are  very nice to me also.\n\nJust out of curiosity... could I ever randomly be fired because parents don't like my skin color? When I pass by parents (the rare times I see them,like, in the parking lot somewhere) they don't say anything to me. Should I be worried or should I let it roll off my back?"
      },
      {
        "author": "Unknown",
        "content": "You mention the parents don’t say anything to you... Do you say anything to them? \n\n \n\nI’m not sure where you are but I have found a lot of Chinese parents/grandparents to be quite shy if they need to make the first move (say hello), especially the first time. \n\n \n\nIn answer to your question, in China if the parents don’t like you, you can be fired for anything, including skin colour. It’s unlikely they’d say explicitly the reason if it was something like that. It’s likely they’d find an excuse rather than be openly racist.\n\n \n\nRegardless why they have an issue, parents will generally start saying anything about a teacher they don’t like though. I had teachers whose style was more quiet and relaxed. The parents in their class didn’t like this so would just complain the teacher didn’t seem to like kids, seemed unhappy etc. Sometimes we could just educate parents a bit and other times nothing worked. They would usually switch classes or leave at the next opportunity. \n\n \n\nI wouldn’t worr"
      },
      {
        "author": "Unknown",
        "content": "I only smile at the parents because I speak only a little Chinese.  The kids are all always very nice. The only problem is many do not speak English so, when I ask about the passage,  don'tk know. I dont grade papErs or anything and they have another English teacher. I see each group of students once a week.\n\n \n\n \n\nI live in Guiyang (southwest China,btw). "
      },
      {
        "author": "Unknown",
        "content": "Well, what makes you think you’re going to be randomly fired?\n\n \n\nAll chinese people know “hello”, you don’t need to speak Chinese. Smiling is good. "
      },
      {
        "author": "Unknown",
        "content": "Nothing. It's just a thought. It's 3 A.M. And my mind has random thoughts at this time."
      },
      {
        "author": "Unknown",
        "content": "Then I'd recommend getting off the computer (if you haven't already done so) and go to bed. The middle of the night is not a good time for feeding mind goblins. If you can't sleep, try reading, or listening to music, or something else relaxing that doesn't involve a screen.\n\n \n\nYou can probably be fired for anything, but it seems highly unlikely to me that you would suddenly be fired for nothing but being black. If the parents don't like you for whatever reason, it's more likely that the school would try to resolve their issue without firing you. They invested time and money into bringing you over and getting you settled, they're counting on you to teach for at least a term, or a year, or whatever. It's in their best interest that your employment works out."
      },
      {
        "author": "Unknown",
        "content": "Yeah I agree. If your skin color was the only reason to be fired, you wouldn't have been hired in the first place. \n\n "
      },
      {
        "author": "Unknown",
        "content": "Lu has it right. Time to sleep :-) \n\n \n\nI’m sure you’ll have a good semester. Let us know if you need any teaching advice too. "
      },
      {
        "author": "Unknown",
        "content": "  \nOn 12/22/2017 at 2:04 PM, Pianote said:\n\nThe only problem is many do not speak English\n\nWhat makes you think the parents' English is any better?"
      }
    ],
    "num_posts": 9
  },
  {
    "title": "M visa instead of z visa please help",
    "url": "https://www.chinese-forums.com/forums/topic/54073-m-visa-instead-of-z-visa-please-help/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I have been hired by a company in china to teach ESL in a training centre. The visa specialist for the company is telling me to apply for a business visa as opposed to a work visa. At first I thought this was no big deal until I saw that that wanted me to lie on my visa application. I have been told what to write and most of it is not true. She tells me that this is normal because applying for a work visa takes too long. I do not feel comfortable falsifying my documents since I will be the one stuck facing the consequences, not the company telling me to do this. Has anyone else had a similar experience? I don't know what to do."
      },
      {
        "author": "Unknown",
        "content": "Assuming you've got the right qualifications, finding a good job teaching English in a good city is not all that difficult. There's no good reason for you to settle for a situation that makes you feel uncomfortable."
      },
      {
        "author": "Unknown",
        "content": "It could be that they have an urgent need for a teacher and want you to start quickly. Then, once arrived, they'll get you the right visa. Alternatively, they could get you over there then treat you terribly.  The fact you're working on the wrong visa might be held over you as you can't exactly go to the police about it. They could also just keep saying they'll get you the visa without actually ever deliverying.\n\n \n\nWhatever the circumstances, definitely don't come and work on the wrong visa. By the sounds of it I would just forget this company and find another opportunity. "
      }
    ],
    "num_posts": 3
  },
  {
    "title": "Work visa for an Indian citizen",
    "url": "https://www.chinese-forums.com/forums/topic/53736-work-visa-for-an-indian-citizen/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hi,\n\n \n\nI am a citizen of India and my passion is towards teaching English for the people in need. When I was in search for it, I found China to be a better place. Unfortunately I don't have a bachelor's degree as I am a dropout. I didn't completely my engineering in computer science. When I enquired with some middle agents in China, they said that without a degree, a human from a non-native country cannot get a work visa without a degree. And they also added that, it is because of the recent changes in the permit laws. \n\n \n\nIs this true? Can't I work in China as an English teacher? Or is there any way for me to teach in China?\n\n \n\nThanks,\n\nDhinesh Rajarathinam"
      },
      {
        "author": "Unknown",
        "content": "No chance. You might get illegal work, without the correct visa, teaching in a badly-run school, but that's it. If you *really* want to do this, look at other locations, or get back to uni (say you finished your degree, got a TEFL qualification, then looked for work teaching English for computer scientists - then you might get somewhere). \n\n \n\nCouple of notes\n\n1) The visa and employment regulations for China are very changeable, and usually getting tougher. Don't start a three year plan to get to China and assume the rules will be the same when you're finished. \n\n2) I understand you might have been writing quickly, but if you're sending in job applications with that many mistakes in (  completely my engineering;  middle agents;  a human ) you won't even get considered except for the worst schools."
      },
      {
        "author": "Unknown",
        "content": "Thanks Roddy for pointing out the mistakes and helping me understand the situation for acquiring a work visa in china. As you said, I was in a little hurry to post this topic. Thanks again.\n\n \n\nDhinesh Rajarathinam "
      }
    ],
    "num_posts": 3
  },
  {
    "title": "Gotten an offer & contract from Beijing Zhongde School. Can't find mucH about it?",
    "url": "https://www.chinese-forums.com/forums/topic/52928-gotten-an-offer-contract-from-beijing-zhongde-school-cant-find-much-about-it/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hi,\n\nI've gotten an offer to teach first grade at Beijing Zhongde School in Chaoyang qu district in Beijing. Can't find much about it which worries me. They say the have been around for 10 years with 10 foreign teachers etc. Also, in the interview I told them I can do 1 year contract, and prefer first grade with 20 to 25 students in the class. They checked my references and offered me the position. But when I read the contract it says 2years! Then I was emailed saying that they might have two 1st grade classes. If so, I'll be the homeroom teacher, if not I'll be teaching 4th or 5th grade. (Huh?! Sounds like confusion)\n\nAm I being setup for the Okey doke and trust my instincts to run like heck? Or, should maybe there's a typo on the length of my contract (feb 2017 to feb 2019) and that I should not assume that the school is unorganized etc?"
      },
      {
        "author": "Unknown",
        "content": "Why not just ask the school directly about the contract length and see what they say?\n\nI work in a school where the contracts for foreign teachers are 2 years as standard but they're 5 for Chinese teachers. Everyone has the 2 year contract but it's fine if you leave after 1 year.\n\nAs for which grade you'll teach, it doesn't sound unreasonable if they don't know for sure just yet. It might depend on new students, students leaving, teachers staying or leaving etc\n\nThen again, if you don't trust who you're talking to then look elsewhere. I'd at least ask them about all this first and see what kind of answers you get. If they are good answers that put your mind at ease then no worries."
      },
      {
        "author": "Unknown",
        "content": "Thank you so much for your advice!\n\nJah456"
      }
    ],
    "num_posts": 3
  },
  {
    "title": "I signed a contract with a school, can I back out?",
    "url": "https://www.chinese-forums.com/forums/topic/50686-i-signed-a-contract-with-a-school-can-i-back-out/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hi,\n\n \n\n4 weeks ago i signed a contract with a Chinese school for teach english one year.\n\n \n\nThey are in the process to help me obtain a Z visa in HK.; they also said they paid 10.000 rmb to sponsor my Z visa: is that a correct\n\ninformation? the Z visa cost that money?\n\n \n\nNow i read the contract i signed and it says \" if the teacher leave early his contract, he must reimburse the school for the visa fee\"\n\n \n\nWhat happens if i back off to this contract? Will the chinese school go after me for the visa fees? /suing me in my own country?\n\nPls note i have not yet applied for any Z visa in HK. I have not yet even received the sponsoring documents from the school via mail.\n\n \n\nI am having double thoughts if I can trust this school and I want to back off;\n\n \n\nif someone can  pls advise\n\n \n\nthanks"
      },
      {
        "author": "Unknown",
        "content": "The visa fee is what you'd pay in Hong Kong when you get the visa. Assuming you will go yourself to the visa office, you'll see the fee quite clearly. It's likely you'll pay it yourself and get reimbursed by the school at a later date (so keep the receipt). It's no where near the figure you suggest. I can't remember exactly but around 500rmb? Perhaps?!\n\nMaybe you've got your wires crossed with the school or lost in translation.\n\nThe contract clause to pay the visa fee back is pretty common. It's a tiny fee relatively."
      },
      {
        "author": "Unknown",
        "content": "Hi\n\n \n\nthank you for your reply.\n\n \n\nThe HR agent that I signed the contract with said the school spent 10.000 RMB to \" process my visa.\" what??\n\n \n\nSo I Guess this guy is lying. Now the question remain: with a signed contract what happens if I never show up to get the Z visa?\n\nand never talk to the school again? will they go after me in my home country?\n\n \n\nthe contract say \"if teacher leaves the contract early ,he should reimburse the school the visa related fees\""
      },
      {
        "author": "Unknown",
        "content": "It's conceivable they've incurred 10,000Y of costs if, for example, they used an agent to help obtain documents, or they've never employed a foreigner before and had to handle lots of formalities there. But I doubt it very much, and it'd be amusing to see what they come up with if you ask to see the receipts. More likely the HR agency trying to scare you into coming, or hoping to get some money out of you.\n\n \n\nDo you still want to go to China? If not, just ignore them. No chance of them suing you in your home country. If you do still want to go to China - again, just ignore them, and start a new application somewhere else."
      },
      {
        "author": "Unknown",
        "content": "The visa fee and the process of the visa fee are two different things.\n\nIf only the visa fee, then you can pay that. Not the process, right?"
      },
      {
        "author": "Unknown",
        "content": "Hi,\n\n \n\nthe school hires hundreds of foreign teachers every year. I doubt they spend 10.000 rmb as they said for each teacher;\n\n \n\nI was at first excited to go and work in China but s I read the contract, I see that they require 25 hrs a week of teaching + 4 hrs\n\na week for pre class preparation, + 4 hrs a week for meeting with parents;\n\nit looks like a lot of work and I will live the race in a big Chinese city....I am not sure if I want that now...\n\n \n\nthey didn't use ny agent to hire me; so the 10 rmb claim is something really shady....\n\nI guess I will just ignore his emails; the point is I have signed a contract and I m not sure how legally bounding it is..."
      },
      {
        "author": "Unknown",
        "content": "25 teaching hours is fairly standard at a private training school, however, often they don't give you that many hours. This is just the max. they can give you.\n\n \n\nThe additional hours also aren't necessarily used. My school has 'office hours' built in but actually there aren't any real office hours. These just apply to doing promotional things at the start of the semester and attending the occasional meeting. New teachers also get 1.5 hours a week of training.\n\n \n\nFrom what you've said about this school so far, I'd probably forget them and move on."
      }
    ],
    "num_posts": 7
  },
  {
    "title": "Chinese Medical Exams and Visa Questions",
    "url": "https://www.chinese-forums.com/forums/topic/50348-chinese-medical-exams-and-visa-questions/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I am on the verge of completing my TEFL certificate and would like to work in mainland China. I do not have a job yet as I am completing the certificate first. I was looking at the requirements for a medical exam and they are quite vague. It does not stress how long an exam may have validity for. I am able to get the required medical elements plus ECG and Chest xray done in the UK but I do not know if I need a medical from my home country, one from China or both. Does the UK one suffice if it covers all of the diseases etc that the Embassy have noted?\n\n \n\nI was also wondering, if I got the medical checked and went to China for a vacation with tourist visa before getting a job, could I leave China, get a job offer for TEFL and then get the working visa processed and picked up in a Chinese embassy in another area like Japan or Hong Kong before re-entering China? I would of course say to a prospective employer to say \"will be picked up in Hong Kong.\"  \n\n \n\nDoes anyone have any answers on "
      },
      {
        "author": "Unknown",
        "content": "It might depend where you work. In Beijing, If you have a medical exam done in your home country, you still have to go to the Beijing medical exam clinic to have the tests 'authorized'. If you don't have any tests you need, then you can have them done there. For this reason, seems like it's easier and cheaper just to get the whole thing done here upon arrival.\n\n \n\nWhen I applied to work in Yinchuan. Tests were done upon arrival at a designated clinic. The school just took teachers there and did the tests one morning.\n\n \n\nUnless you are explicitly told (by your employer or the embassy) that you need the medical exam for the actual Z visa (that you'd apply for in your home country), I'd plan to do it on arrival.\n\n \n\nYou shouldn't need a medical exam for a tourist visa. You could go and have the medical done in Beijing though, while you're here as a tourist. You can just go there and check the box 'work'. They'll do the right tests and you can pick them up later.\n\n \n\nTechnically you can o"
      },
      {
        "author": "Unknown",
        "content": "Do the medical exam after you arrive in China. It will be a lot less hassle.\n\nI managed to get a Z visa in Hong Kong in December 2014. As far as I know, the invitation for the visa should state the location where the visa will be applied for. So you won't be able to do it in Hong Kong unless it specifically says this on the invitation.\n\nBy the way, it is very time consuming to arrange a Z visa. Many companies ask you to come over on a different visa first, and then convert to a Z visa (involving a trip to Hong Kong or back to your home country) after you have arrived. I'm not saying you should or shouldn't do this - just be aware that it is common practice."
      },
      {
        "author": "Unknown",
        "content": "The time at our school is, at best, 6 weeks from the point you've been hired to actually being able to arrive in China.\n\nAs for coming over on an L visa and then tranaferring, I'd disagree that it's common practice now with teaching jobs. I'd have doubts about any school that asked you to do this. It may work out fine but you'd be the one working illegally while you wait. They might just keep stringing you along with the promise of a Z that never materialises. If you meet all the requirements to work as an English teacher in China there should be no reason to arrive on a different visa. The school can sort it out before you come. If they say they can't, maybe they don't have the authorisation to even hire foreign teachers."
      }
    ],
    "num_posts": 4
  },
  {
    "title": "Bank account problems with visas",
    "url": "https://www.chinese-forums.com/forums/topic/49109-bank-account-problems-with-visas/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hi there,\n\n \n\nI'm looking into doing a TEFL course and hoping to teach english in China. I currently have an overdraft on my bank account after just leaving uni. I was wondering if anyone could shed some light on whether this will be an issue when applying for a visa? I couldn't see anything on the government websites but I know certain countries only issue visas if you have a certain amount of money in your account.\n\n \n\nThanks!"
      },
      {
        "author": "Unknown",
        "content": "What country are you from/what passport do you carry?\n\n \n\nMight differ from place to place, but no financial information was requested when I applied for and received a China tourist (L) visa from the USA in December of 2014."
      },
      {
        "author": "Unknown",
        "content": "A bank statement is not usually a requirement when applying for a Z visa.\n\nYou would need to have some money when you first arrive and for that first month. You'd normally be paid at the end of the first month then every month after that. If you're short on cash you may be able to get an advance."
      }
    ],
    "num_posts": 3
  },
  {
    "title": "seeking visa and TESOL/TEFL guidance for newbie",
    "url": "https://www.chinese-forums.com/forums/topic/48497-seeking-visa-and-tesoltefl-guidance-for-newbie/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I stumbled upon this forum while doing research on visas for working in China. You will be able to tell from my post that I’m a total newbie at this, but here goes.\n\nI have B.S. in Chemistry and I’m seeking to find a job teaching English in China for the upcoming Chinese school year. But I’m scheduled to go to china with a company I went with last summer as a volunteer English teacher on July 2. I learned today that I can not switch to a Z visa while in China on an L visa.\n\n \n\nI wanted to get any feedback on what my best course of action would be.\n\nI am considering getting an ESL certification while in China, but do not know how that might work, or if I should look for jobs before getting the certification, or even if I can get the certification while in China on an L visa, while looking for a teaching job. I’ve been told that it’s easier to find a job while there.\n\n \n\nSo my questions are as follows.\n\n \n\n1. What TESOL/TEFL certification(s) would give me the best chance of finding an En"
      },
      {
        "author": "Unknown",
        "content": "I am sure that many others will offer better advice but until then you need to consider the requirements for an application for a z visa.\n\n \n\nYou have a Bsc. Check. In fact, that may be very useful for you to find work in that field with a decent salary.\n\n \n\nUnfortunately, I have to ask, are you from a nation where English is the official language?\n\n \n\nHave you work experience (at all)? Your age may also be a factor.\n\n \n\nYou have come to a great site in all things China and I am sure other more experienced posters will offer much better input.\n\n \n\nps I think if would be best to apply for the z visa at home and not do the second visa route. Although this depends very much on the institute that you will be teaching in, you fulfilling the requirements and the location of the said institution you will be landing in. Good Luck, it seems you have a very positive outlook!\n\n \n\nedit\n\n \n\npps In regards too certification, that would depend on your abilities. I started teaching TEFL type courses i"
      },
      {
        "author": "Unknown",
        "content": "1. What TESOL/TEFL certification(s) would give me the best chance of finding an English teaching job in China?\n\n \n\nIf a company is willing to accept an online or unaccredited TEFL certificate then it really doesn't matter which one you have. They aren't really worth anything more than the nice certificate they give you. This enables your school to get your expert certificate and proceed to get the residence permit. The only time it may be worth doing one over the other is if the school/company you want to work for offer one 'in house'. This will likely be more relevant and use the books /resources that the schools use.\n\n \n\n2. Is it possible, or even sensible, to travel to China on an L visa, look for a teaching job, and then travel to Hong Kong to switch to a Z visa once I am hired?\n\n \n\nYou can no longer get invitation letters for Hong Kong so no, that wouldn't be sensible. I'd find a job from home and get everything sorted before you go.\n\n \n\n3. Or would it be better to get a job befor"
      },
      {
        "author": "Unknown",
        "content": "Regarding the idea of finding a job while on an L-visa and switching to a Z-visa (I have gone this route twice), I once went to Ulaanbaatar, Mongolia for my visa run, rather than HK. This was a number of years ago, and I don't know if getting a Z visa in Mongolia became impossible at the same time that getting one in HK did. Maybe worth looking into (or ChTTay or someone else here might know). It is an interesting trip in its own right.\n\n \n\nMany, but not most, employers of foreign teachers in China ask for a some kind of ESL certificate as a base requirement. Some specify a 100-hour course with a practicum component (i.e. not online)."
      },
      {
        "author": "Unknown",
        "content": "I would phrase that \"most ask for a TEFL cert but few care what kind it is\". This is especially the case for schools in less desirable places to live, smaller companies with one school, smaller Universities etc etc. If you are looking at somewhere like EF, Wall Street English... Then you'd need a CELTA or certified TESOL with observed teaching practice yada yada.\n\nBefore I arrived in Beijing I heard someone do a visa run to Mongolia but that was 3 years ago. Not heard anyone do it since. If they are closing off HK I'm not sure why they would have left Mobgolia alone. The safest, least stressful thing would be just to apply at home.\n\nYou should just the school to speak to previous and current teachers, research the city/area online, find out the exact school location (Google maps) and generally do your research on anywhere before agreeing to go. Be wary of some internet reviews as mostly it's angry and annoyed people who post reviews, not people who had no problems."
      },
      {
        "author": "Unknown",
        "content": "This is much needed and much appreciated information guys…Thanks. I am from the U.S. and 44 years old, so those may be factors to consider as well.\n\n \n\nBut it sounds like my best course of action is to cancel going in July to teach on an L visa, and just focus on finding an English teaching job and getting the Z visa, since that is my ultimate goal. That’s kind of a bummer, but the best or correct way to do things isn’t always the desirable way.  \n\n \n\nGaHanna is so right, this site is a great resource on all things China. Wish I had come across it a couple months ago when I started looking at doing this."
      }
    ],
    "num_posts": 6
  },
  {
    "title": "Switching schools mid-visa",
    "url": "https://www.chinese-forums.com/forums/topic/48348-switching-schools-mid-visa/",
    "posts": [
      {
        "author": "Unknown",
        "content": "     I'll be starting my second year with another (*sigh*) English training school in China in a couple of days, and I've been approached by a number of universities about teaching for them full time in September. Some background: I had originally planned to teach for a university in March, but missed the boat due to an unexpected injury in the states. Since my present work visa places me thoroughly in the hands of yet another dastardly private training school until May of 2016, I'm wondering if there's any way to amicably terminate my contract sometime within the next 5 months while also procuring the reference letter necessary for me to obtain another work visa.\n\n \n\n     I'd heard from a friend of mine who manages a school in another city that my work visa could be bought, so to speak, from my training school by whichever university wishes to hire me (should they so choose). How would this bode for my getting a subsequent work permit within the same year for which my previous one was"
      }
    ],
    "num_posts": 1
  },
  {
    "title": "Advice on Leaving Current Contract",
    "url": "https://www.chinese-forums.com/forums/topic/46930-advice-on-leaving-current-contract/",
    "posts": [
      {
        "author": "Unknown",
        "content": "I am currently working on a one-year contract. I am 10 months in, and was planning on getting a bonus at the end along with plane tickets reimbursed, and a Spring Festival vacation period. However, the school has had me traveling to 4 different sites throughout the week to teach, some being 2 hours away from where I live. I was willing to deal with the annoyances, including being fined for not sending various reports and newsletters that they wanted me to write, and being fined 1000 yuan for a weekend sick day.\n\n \n\nA month ago the school granted me a weekend leave (my first leave granted thus far), only to tell me a few days ago that it was not granted and that I was lying (it was granted verbally by my manager, but the general manager says he doesn't believe me, and my manager lies and says she didn't officially grant any vacation or leave time). I told the general manager I have friends in the foreign expert department (which I do) and said that if they can't treat me reasonably that"
      },
      {
        "author": "Unknown",
        "content": "Does a blacklist really exist?"
      },
      {
        "author": "Unknown",
        "content": "If they have you on a legit visa (Z-visa), you could try reporting them to the authorities that issue invitations to foreigners. I doubt it will get you very far, but you never know.\n\n \n\nOn the other hand, if they are employing foreigners illegaly, then you could report them (after you've left of course). It won't solve your situation, but revenge is still sweet."
      },
      {
        "author": "Unknown",
        "content": "Thanks for the advice. Well, I know for a fact that the blacklist does exist, but it seems to have only lead to further corruption as schools in China now hang threats over teachers' heads. This leaves very little recourse for teachers to do anything about the corruption, unless they happen to have guanxi, and even then there is not guaranteed immunity.\n\n \n\nI have a friend in the city where I live who owns a school, and said he can grant me a Z-visa after I leave this school. However, the school I have been working at thus far has not been willing to give me my release letter. My plan is to return to my country for 2 months, and then reapply after the residence permit has expired. However, my friend tells me that I NEED the release letter no matter what. Is he confused, or is this really the case? I honestly think he's contradicting some earlier statements he made, as I recall him telling me before that I could reapply for a Z visa within my home country without a release letter, and t"
      },
      {
        "author": "Unknown",
        "content": "It may be different in different parts of China, but as far as I know, in Shanghai, a release letter is required if you seek a new job with five years of having left your previous job."
      },
      {
        "author": "Unknown",
        "content": "Anonymoose, I don't believe that's true as long as you've completed your previous contract. If you haven't. you may need a letter, but my new employer hasn't asked me for a release from my previous employers even though that one ended 2 years ago this month.\n\n \n\nIt might well be that in some areas like Shanghai that they've needed to tighten things up a bit in that regards. I'd expect places like Shanghai and Beijing where people get paid more and more foreigners want to live to have tighter rules about things like that.\n\n \n\nPersonally, if it were me, I'd do my best to suck it up. This is a common tactic here in the US when you want to get rid of somebody, but you don't want to have to pay severance. I would assume that it's a practice that exists in China as well.\n\n \n\nThen fine itself isn't great, but that's a fairly common practice, depending upon how you're scheduled, that sounds like they're just not paying you for the day.\n\n \n\n@StudyChinese, I'm pretty sure there is a blacklist of"
      }
    ],
    "num_posts": 6
  },
  {
    "title": "X-2 Visa (student) conversion to Z-Visa advice/help",
    "url": "https://www.chinese-forums.com/forums/topic/45488-x-2-visa-student-conversion-to-z-visa-advicehelp/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hello. I have a few question about the conversion process and a few specifics about my circumstances. I hope someone can help.\n\n \n\nFirst off, I came to China to do business and my current intention is to acquire a working visa and later acquire sufficient capital through other means. This is like an end goal for me and not really the point of this thread. Anyway, I am currently in Sichuan province on an X-2 visa \"Interning\" at a kindergarten. The organization that enabled me to get the X-2 visa and whom I signed the contract with are intent on having me leave the country if I decide to quit. Similarly, the pay isn't very good and I have opportunities for much better paying jobs, so I want to quit this current job and obtain a z-visa. The problem is that if I leave the internship prematurely, and do not leave the country, they will alert the authorities (I'm not sure they even have this right. My source says that they are somehow responsible for me while I'm over here). I am not really "
      },
      {
        "author": "Unknown",
        "content": "Firstly, the visa (X or Z) is just what enables you to enter the country. After this, for more long term visas, you should have a \"residence permit\" in your passport. It is this residence permit that is renewed or converted. For conversion, they would change the purpose of your stay on the residence permit from one thing to another,\n\nAs a an X visa is a student Visa and not a work Visa, then i'm not sure your \"employer\" has any real hold over you. How much is your contract worth when you are working illegally afterall? I am not sure but you could probably ask to cancel that visa/residence permit when you go and apply for a new one. I had two days left on a student residence permit when I was in Hong Kong and, before they accepted my Z visa application, they asked me if I wanted to cancel the current student residence permit. Note that I wasn't converting anything, I just went to HK to apply for a completely new Z visa. That would allow me to enter the country, then my employer would he"
      },
      {
        "author": "Unknown",
        "content": "\"I am not really concerned about this as we all know that Chinese authorities, for the most part, don't give a shit about much.\"\n\nHopefully you're right, but the times, they are a-changing. That guy did a little illegal teaching and now can't get into China for love nor money. If you have long-term plans here, I wouldn't risk \"interning\". "
      },
      {
        "author": "Unknown",
        "content": "You are right that nobody cares about you working on an X-visa, however I doubt that your employer would want to make a big thing out of it, as they probably want to stay out of trouble too.\n\nIn general applying for a work visa while being on an X visa from a school should not be a problem. At least in Beijing you have to return to your home country during the process usually though. I would ask an agency or work for a company with a very experienced HR department. Applying for a work visa yourself is an administrative nightmare..."
      },
      {
        "author": "Unknown",
        "content": "I had an a student residence permit (originally an X visa) then headed to HK to apply for a new Z visa. It worked out fine but my employer provided all the documents. Also, this was one year ago and there are reports of HK getting harder and harder to obtain certain visas in certain circumstances.\n\nYou could always go home for a holiday and apply there."
      }
    ],
    "num_posts": 5
  },
  {
    "title": "Converting X-2 Visa to Z-Visa",
    "url": "https://www.chinese-forums.com/forums/topic/45487-converting-x-2-visa-to-z-visa/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Hello. I have a few question about the conversion process and a few specifics about my circumstances. I hope someone can help.\n\n \n\nFirst off, I came to China to do business and my current intention is to acquire a working visa and later acquire sufficient capital through other means. This is like an end goal for me and not really the point of this thread. Anyway, I am currently in Sichuan province on an X-2 visa \"Interning\" at a kindergarten. The organization that enabled me to get the X-2 visa and whom I signed the contract with are intent on having me leave the country if I decide to quit. Similarly, the pay isn't very good and I have opportunities for much better paying jobs, so I want to quit this current job and obtain a z-visa. The problem is that if I leave the internship prematurely, and do not leave the country, they will alert the authorities (I'm not sure they even have this right. My source says that they are somehow responsible for me while I'm over here). I am not really "
      }
    ],
    "num_posts": 1
  },
  {
    "title": "Breaking Contract",
    "url": "https://www.chinese-forums.com/forums/topic/44907-breaking-contract/",
    "posts": [
      {
        "author": "Unknown",
        "content": "Assuming someone signs a teaching contract for 6 months to a year and a few months in decides to leave, what are the typical reprocussions? I understand that many schools will offer bonuses or flight allowance on completion, is that typically the only issue with leaving early?\n\n \n\nThanks."
      },
      {
        "author": "Unknown",
        "content": "In most cases, if you break your contract you won't get your bonus. The bonus is an incentive to finish the contract.\n\n \n\nOther consequences, depending on the reach of the school, can include:\n\n \n\n1. Immediate revocation of working documents.\n\n2. \"Blacklisting,\" which includes a note in your electronic file that you're unreliable, to which other schools have access.\n\n \n\nIn reality, the aforementioned consequences aren't life-altering, especially if you do not intend to teach in China again. Additionally, it's a small price to pay if you end up being very unhappy with your employer.\n\n \n\nIf you're currently researching schools in China, do yourself a huge favor and do your due diligence in researching the institution. Ask to speak with current and former employees, ask questions about the contract, ask for pictures (of the school, apartments provided, etc.), and look for reviews online (which must be taken with a grain of salt).\n\n \n\nGood luck!"
      },
      {
        "author": "Unknown",
        "content": "If you plan to teach again elsewhere in China it may be quite difficult without a \"letter of release\" from the previous school. In Hainan this is required for a successful application for a new work visa, regardless of the length of time that has elapsed since the previous contract's conclusion. I have heard of this requirement elsewhere as well, but don't have experience in other provinces."
      }
    ],
    "num_posts": 3
  },
  {
    "title": "Avoiding Chinese in the ESL classroom",
    "url": "https://www.chinese-forums.com/forums/topic/40422-avoiding-chinese-in-the-esl-classroom/",
    "posts": [
      {
        "author": "Unknown",
        "content": "As someone who hasn't yet graduated from university and so hasn't gone through formal ESL training, forgive me for not yet knowing the mainstream teaching techniques that such a course would teach - that said, I'm doing no more than preschool teaching and private tutoring.\n\nThis is already clear to me for higher level students, but imagining for a moment that all one's students speak a single native language, for low level learners I can't quite grasp why there is such a strict idea of never using their native language (L1) in class. I can only offer my experience learning Chinese and tutoring experience as my point of view, so I'm writing this in hope of someone explaining better for me.\n\nTo clarify, I understand that in general L1 should be kept to a minimum and certainly not used as the primary communication in class. A few reasons I often read are that it discourages the learner from looking up words or grammar points in their own dictionaries, and that learners should be encourage"
      },
      {
        "author": "Unknown",
        "content": "It is perfectly possible to teach all in L2 but I definitely agree that it's not always desirable and yes, I've never understood why it's sometimes seen as taken as a matter of faith that everything must be in L1.\n\nI remember years ago coming across the idea of allowing small groups of students -- sometimes -- to prepare a collabarative task first in L2, then give then a minute or two to run over everything in L1, before returning to L2: just to iron out any inefficiencies and misunderstandings. And this was a spoken English class, rather than anything grammar-heavy. It gave the weaker students confidence that they hadn't missed stuff and weren't about to make fools of themselves.\n\nOf course there are good reasons to stick to L2 for long periods of time, or for entire classes. Focussing for 90 mins in a foreign language is obviously a useful discipline to get comfortable with.\n\nThe best reasoning I've heard behind the \"classroom-immersion\" idea is this: if you accept that there's a \"us"
      },
      {
        "author": "Unknown",
        "content": "I think most teachers will, when it makes more sense and you've got a monolingual class and you speak that lingo, use L1 to a certain extent. I would very rarely if ever speak Chinese, but if I heard one student say \"Oh, does he mean XX\" then I might nod, or ask him to quickly explain to the rest of the class. So i would understand L1, but not speak it. Or I might use L1 to explain something to one student while everyone else is doing something else. Etc.\n\nA lot of TEFL theory comes out of universities and schools in English-speaking countries, where there won't be a classroom L1 - you'll have L1a, L1b, L1c, and so forth. In practice I'm not sure it's the taboo its made out to be, and when it is, it's quite likely because that particular teacher only speaks English.\n\nIt's a slippery slope though, once a class knows you speak Chinese and will use it if they're struggling. Half of them will not try to understand as they know they'll get the Chinese in the end, the other half will pretend"
      },
      {
        "author": "Unknown",
        "content": "The so-called 'theory' is a laughable attempt to brush over the inescapable facts. 99% of TEFL teachers, fresh off the plane, are monolingual English speakers. They cannot speak the language of their chosen country so they use English exclusively. The TEFL industry therefore conjures up a theory that teachers should use English exclusively. Because that is going to happen anyway. The theory depicts an inherent weakness as a strength and so the TEFL cash cow is preserved and everyone is happy.\n\n \n\nObviously I'm referring to teaching younger learners and novices (which, in Asia, is practically everyone). Advanced classes, by contrast, should be taught in English."
      },
      {
        "author": "Unknown",
        "content": "吳山, if I remember correctly you're a teacher (apologies if I'm wrong). How are you handling it? "
      },
      {
        "author": "Unknown",
        "content": "I avoid English in class as much as I can, but I find sometimes it's needed.\n\n \n\nI could spend about 5 minutes trying to explain a single word or concept in English and just confuse them with more and more words they don't know...\n\n \n\nBut I find it much more practical to give them the occasional difficult to explain word in Chinese so we can move on to more interesting things and quiz them about the word later."
      },
      {
        "author": "Unknown",
        "content": "  Quote\nI avoid English in class as much as I can, but I find sometimes it's needed."
      },
      {
        "author": "Unknown",
        "content": "Roddy, that's right. I find teaching in China is more rewarding than it was in Thailand (the Thai education system is a tragedy). Though I'd rather spend all my time learning Chinese, TEFL is a suitable compromise for now."
      },
      {
        "author": "Unknown",
        "content": "Posted 28 February 2014 - 09:11 AM\n\nQuote\n\n  Quote\nI avoid English in class as much as I can, but I find sometimes it's needed.\n\n \n\nErm, Yes! Exactly!\n\nWhile researching some new teaching techniques I decided it would be advantageous to teach my students without using any English at all.\n\nHowever, I cannot share the methods du《UNRECOGNISED DATA ENCODING》\n\n \n\n** Never admit failure or defeat, even when it's really obvious **\n\n \n\nIt was probably those admins modifying my posts to make me look bad anyway ^_^"
      },
      {
        "author": "Unknown",
        "content": "Yeah, we do that a lot. Mostly to each other though. \n\n \n\nAs I've said, I'm not opposed to the odd use of L1. But before doing so, I think you should ask yourself if you're doing this because it's really necessary, or because you either haven't thought properly about how you're going to explain something, or if you're teaching something that is above the class's level, or if you're letting yourself get dragged off plan by random questions from students.*\n\n \n\n*which is sometimes ok, but stuff's on your lesson plan for a reason. Or at least it should be. "
      }
    ],
    "num_posts": 10
  }
]