[
  {
    "title": "Fraud Warning: WorkAndLiveInChina .com is nasty China TEFL Job Scam",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9232&sid=efec3d660f88bab5db0c7dd19dd64e39",
    "posts": [
      {
        "author": "Unread post\n by Prometheus » 04 Oct 2021, 15:17",
        "content": "Fraud Warning: WorkAndLiveInChina .com is nasty China TEFL Job Scam\nQuote\n\nUnread post\n by Prometheus » 04 Oct 2021, 15:17\n\n\n\nJust a head's up to all my TEFL colleagues that this original complaint from a former employee unleashed a storm of posts that are now being censored by a paid hacker. So have a read and share this with every expat you know before it also disappears:\nhttps://www.reddit.com/r/China/comments ... ency_scam/\n\nBTW... This fraud was first reported by China Scam Patrol and the CFTU in 2019 when the scammers began cold-calling expat TEFL teachers with a great lie: \"Sorry for the delay John nut I just got around to reading you resume and I have some great news for you!\" Unfortunately \"John\" (and hundreds of other targets never sent a resume to this gang) This story shows exactly why we need to pay more attention to scam warning sites like\n\nhttps://reddit.com/r/ChinaCheaters\nhttps://reddit.com/r/ChinaScamPatrol\nhttps://reddit.com/r/ChinaScamCentral\nhttps://reddit.com/r/TE"
      },
      {
        "author": "Unread post\n by Tiger » 08 Oct 2021, 22:47",
        "content": "Re: Fraud Warning: WorkAndLiveInChina .com is nasty China TEFL Job Scam\nQuote\n\nUnread post\n by Tiger » 08 Oct 2021, 22:47\n\nI knew they were scammers the very first time they called me and said they had reviewed my resume and I qualified for three different jobs yet \"Martin\" could not tell me the salaries offered nor what was the closest subway station was for any of the employers. Furthermore, I never send them my resume! I shared this info with my roommate who wanted to schedule an interview, so I gave him the call back number that registered automatically on my phone. When he called back and asked for Martin, a Chinese woman said \"There is no Martin here\".\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      },
      {
        "author": "Unread post\n by Vagabond » 28 Jan 2022, 23:53",
        "content": "Re: Fraud Warning: WorkAndLiveInChina .com is nasty China TEFL Job Scam\nQuote\n\nUnread post\n by Vagabond » 28 Jan 2022, 23:53\n\nAll of the worst TEFL scams are identified at https://reddit.com/r/teflscams. Be sure to download both the White and Blacklist and tape it to your refrigerator.\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by emilianojay » 04 Nov 2024, 06:52",
        "content": "Re: Fraud Warning: WorkAndLiveInChina .com is nasty China TEFL Job Scam\nQuote\n\nUnread post\n by emilianojay » 04 Nov 2024, 06:52\n\nYour attempts to warn others through comments on social media platforms are commendable. It’s frustrating that your warnings were deleted and that the agency has gone private to shield themselves from scrutiny. This behavior is typical of fraudulent operations trying to maintain a façade of legitimacy age of war"
      }
    ],
    "num_posts": 4
  },
  {
    "title": "Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9031",
    "posts": [
      {
        "author": "Unread post\n by Vagabond » 01 Apr 2021, 21:38",
        "content": "Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by Vagabond » 01 Apr 2021, 21:38\n\n\n\nThis Video is self-explanatory and if you don't watch it you will cheat yourself out of two months salary in most countries and 3 month's salary in others... https://youtu.be/9qLbXGjOSIE\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by Atlas » 10 Apr 2021, 16:52",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by Atlas » 10 Apr 2021, 16:52\n\n\n\nYou brought up just one aspect of contract fraud. Another BIG problem are the recruiters who never let their teacher applicants sign employment contracts with the actual school - only their agency. BIG MISTAKE! I suggest everyone read this article from top to bottom to avoid getting screwed out of BIG BUCKS - as much as $10,000 a year. https://chinaforeignteachersunion.wordp ... contracts/\nLook Before You Leap at https://reddit.com/r/teflscams"
      },
      {
        "author": "Unread post\n by John V55 » 10 Apr 2021, 17:54",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by John V55 » 10 Apr 2021, 17:54\n\nRe: Your link. I clicked on the link and was so surprised that it didn't tell me anything but took me to eight spam filled pages from the CFTU, with so many links I didn’t bother to go any further.\n\n‘I will guess you might be pretty shocked or upset right about now and I don’t want to tuin your day, but just so you know, about 80% of every veteran TEFL teacher went through this same deception.’ Are you sure it wasn’t 80% don’t fall for contract scams?\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by John V55 » 10 Apr 2021, 18:49",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by John V55 » 10 Apr 2021, 18:49\n\nLike it or not, we live in an age of third-party recruiters. Schools and businesses employ them because they pay them a certain amount and for that they will do all the bureaucratic legwork to get the employer a teacher.\n\nThe director knows how much they’re paying the recruiter and also what the recruiter is paying the teacher. It’s not likely that the director or one of their staff is going to do the work themselves for nothing and you get to keep the profit and get paid 30 to 40% more than the rest of the teachers.\n\nWhat the spammers have to do now is list half a dozen schools that you can contact who will pay you more than everyone else.\nInternational schools that only employ registered and qualified teachers in their home countries don’t count.\n\nIt’s not going to happen, which is why all you will get are more links that lead to other links in a never ending merr"
      },
      {
        "author": "Unread post\n by John V55 » 10 Apr 2021, 18:50",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by John V55 » 10 Apr 2021, 18:50\n\nLike it or not, we live in an age of third-party recruiters. Schools and businesses employ them because they pay them a certain amount and for that they will do all the bureaucratic legwork of interviews and visas to get the employer a teacher.\n\nThe director knows how much they’re paying the recruiter and also what the recruiter is paying the teacher. It’s not likely that the director or one of their staff is going to do the work themselves for nothing and you get to keep the profit and get paid 30 to 40% more than the rest of the teachers.\n\nWhat the spammers have to do now is list half a dozen schools that you can contact who will pay you more than everyone else.\nInternational schools that only employ registered and qualified teachers in their home countries don’t count.\n\nIt’s not going to happen, which is why all you will get are more links that lead to other link"
      },
      {
        "author": "Unread post\n by Prometheus » 13 Apr 2021, 14:34",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by Prometheus » 13 Apr 2021, 14:34\n\n\n\nI sense you have not been teaching recently in China John? I say this because more and more of us are avoiding the shady recruiters and all the scammy visa and job agents and finding our own teaching gigs. That used to be impossible, or at least very difficult about 5-6 years ago because of the language barrier and the difficulty finding the contact information for the schools. But today in 2021 most all the schools have bi-lingual FAOs (Foreign Affairs Officers) or HR people that speak pretty good English, and we can all get the schools contact lists from either the China Teachers Alliance( (CTA) or the China Foreign Teachers Union (CFTU for free. But the CTA only has employer lists for China and the CFTU has free lists world-wide. You can get a copy of the lists by email or visiting https://reddit.com/r/CFTU and scrolling down about half way. I recently got a "
      },
      {
        "author": "Unread post\n by Vagabond » 29 Jan 2022, 00:06",
        "content": "Re: Beware! The TEFL Teacher Vacation Contract Trap - A Costly Scam\nQuote\n\nUnread post\n by Vagabond » 29 Jan 2022, 00:06\n\nHopefully all of you who have read this thread have renegotiation your contract by now to get those extra three months of pay that you are entitled to by Chinese law - so long as you are a full-time employee. If you are offered jobs that offer you less than 40 hours of work per week, be aware you will lose all of your employee rights and mandatory pay. Even a 39 hour work week is a \"part-time\" job and by accepting that job you will lose over $5,000 - $10,000 of income per year.\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      }
    ],
    "num_posts": 7
  },
  {
    "title": "Warning China Foreign TEFL Teachers - Probationary Period Scams Are Illegal",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9024",
    "posts": [
      {
        "author": "Unread post\n by Tiger » 30 Mar 2021, 14:30",
        "content": "Warning China Foreign TEFL Teachers - Probationary Period Scams Are Illegal\nQuote\n\nUnread post\n by Tiger » 30 Mar 2021, 14:30\n\nYesterday I attended a Zoom Seminar given by the China Teachers Alliance which included a 15 minute lecture by Scott of the China Scam Patrol who opened our eyes about a devious scheme that many school use to cheat out out of half our pay for the first \"90 day/180 day probationary period\". As you may have found out by surprise on payday, or it may have even been included in your contract. CHINESE LABOR LAW makes it illegal for you to have more than a 30 day probationary period for every 1 years of your contract. BUT, if you agree to something more in your contract you are screwed unless you are willing to make a complaint with the ministry of Labor. If you let this slide you will be giving up around $10,000 of pay or even more, depending where you are working. You can get a copy of Chinese Labor Laws in English from the CFTU and in Chinese from the CTA by email"
      },
      {
        "author": "Unread post\n by Blue Moon » 03 Apr 2021, 16:07",
        "content": "Re: Warning China Foreign TEFL Teachers - Probationary Period Scams Are Illegal\nQuote\n\nUnread post\n by Blue Moon » 03 Apr 2021, 16:07\n\nYep. Both my roomie and myself were victims of this sneaky scheme. Lisa lost 50% of her salary for 6 months ($8,500) at Best Learning and I lost even more. When you consider that we have 7 foreign teachers at my school you can see how they exploit expat teachers in China. BTW... All the China labor laws are in English at https://reddit.com/r/cftu\n\nMake sure your contract specifies if you have a probationary period or not and if it does make sure you write in \"one month probationary period\". This is a shitty way to lose half of your pay.\nWatch your step in China. There is a pile of shit waiting for your foot around every corner that only laowai seem to step in. See https://reddit.com/r/workabroadfraud."
      },
      {
        "author": "Unread post\n by Vagabond » 17 Apr 2021, 03:33",
        "content": "Re: Warning China Foreign TEFL Teachers - Probationary Period Scams Are Illegal\nQuote\n\nUnread post\n by Vagabond » 17 Apr 2021, 03:33\n\n\n\nThis is a VERY common scam in China. Thanks for bringing it to our attention. It may seem like a little thing, but when you do the math, you are giving up 25% to 50% of your salary!\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by Vagabond » 28 Jan 2022, 23:51",
        "content": "Re: Warning China Foreign TEFL Teachers - Probationary Period Scams Are Illegal\nQuote\n\nUnread post\n by Vagabond » 28 Jan 2022, 23:51\n\n2022 UPDATE: This scam is still alive and well - so BEWARE colleagues!\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      }
    ],
    "num_posts": 4
  },
  {
    "title": "5 Reasons to avoid online Scam TEFL job ads at Echinacities, Beijinger, ESL Cafe...",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9243",
    "posts": [
      {
        "author": "Unread post\n by Vagabond » 09 Oct 2021, 04:02",
        "content": "5 Reasons to avoid online Scam TEFL job ads at Echinacities, Beijinger, ESL Cafe...\nQuote\n\nUnread post\n by Vagabond » 09 Oct 2021, 04:02\n\n\n\nAfter teaching more than a decade in China please trust me when I tell you that 70% of all online TEFL job ads you see are for non-existent jobs and in the TEFL industry they are called \"bait ads\" designed only to acquire a truck load of new resumes. These ads invariable will generate call backs from black schools, unregistered China job agents or recruiters, or an identity thief impersonating a head hunter, school principal, or even an HR rep from \"a fortune 500 company in Beijing or Shanghai. They will stop calling you after they have three things... 1) Your resume with color photo 2) Color scans of your passport 3) All your personal info including your signature on a contract for a great-paying but fake job they offered you. Now I will tell you what happens with Echinacities which actually tells you to upload your resume online to their website "
      },
      {
        "author": "Unread post\n by kellanfarday » 15 Oct 2021, 13:47",
        "content": "Re: 5 Reasons to avoid online Scam TEFL job ads at Echinacities, Beijinger, ESL Cafe...\nQuote\n\nUnread post\n by kellanfarday » 15 Oct 2021, 13:47\n\nGlad I logged in and saw this first before clicking on an ad."
      },
      {
        "author": "Unread post\n by Vagabond » 20 Oct 2021, 17:00",
        "content": "Re: 5 Reasons to avoid online Scam TEFL job ads at Echinacities, Beijinger, ESL Cafe...\nQuote\n\nUnread post\n by Vagabond » 20 Oct 2021, 17:00\n\nUPDATE:\n\nI would go one step further and say do not consider any TEFL teaching job without getting a passport or ID scan of the person who is trying to recruit you. If they only give you a first or last name - run. Ditto if they give you a bogus Chinglish name like Tom Chen or nick name like Ying Ying.\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by colinarnold » 14 Jan 2022, 09:31",
        "content": "Re: 5 Reasons to avoid online Scam TEFL job ads at Echinacities, Beijinger, ESL Cafe...\nQuote\n\nUnread post\n by colinarnold » 14 Jan 2022, 09:31\n\nThanks for the information!"
      }
    ],
    "num_posts": 4
  },
  {
    "title": "A Warning about TEFL Forum Recruiter Moles and their stealth methods...",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9042",
    "posts": [
      {
        "author": "Unread post\n by Cricket » 13 Apr 2021, 17:11",
        "content": "A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Cricket » 13 Apr 2021, 17:11\n\n\n\nAnyone who spent any time at ESLCafe already knows about this topic. I am talking about where the mods are really moonlighting TEFL recruiters and sit in wait like a spider waiting for some newbie to come along and ask a simple question like \"What do I need to know to get a teaching job in China?\" The mod will be friendly and helpful and answer the question but may omit key information like the mandatory Z visa and verifiable bachelor degree and police certificate. Then within minutes the mod or one of his many sock puppet user accounts will send a follow-up PM that \"highly recommends a great recruiter I have worked with for years\" and that newbie will be given an email or phone number to the recruiting agency that is either owned by the mod himself or from where he collects a referral fee (typically $500). The mod usually does the PM referral with a sock puppe"
      },
      {
        "author": "Unread post\n by Atlas » 15 Apr 2021, 02:42",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Atlas » 15 Apr 2021, 02:42\n\n\n\nWell now, I guess we don't need Sherlock Holmes to tell us who on this TEFL.net forum fits the profile described by the China Scam Patrol since there is only one user on this forum who has over 300 posts , a 5+ year history here, and constantly posts s resume and urges visitor to work for public school in Inner Mongolia. Cricket you called it about a month ago. I apologize for not believing you back then.\nLook Before You Leap at https://reddit.com/r/teflscams"
      },
      {
        "author": "Unread post\n by Blue Moon » 15 Apr 2021, 03:34",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Blue Moon » 15 Apr 2021, 03:34\n\nI suppose that is a very clever way to recruit teachers - stealth sales!\nWatch your step in China. There is a pile of shit waiting for your foot around every corner that only laowai seem to step in. See https://reddit.com/r/workabroadfraud."
      },
      {
        "author": "Unread post\n by Vagabond » 15 Apr 2021, 16:37",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Vagabond » 15 Apr 2021, 16:37\n\n\n\nI think the only people who don't know about these con artists by now are the wannabe teacher prospects, or the newbies searching online forums for their first or second jobs abroad. I think Joe himself warned about these characters about 5 years ago in one of his scam posts. The real problem is some of these forum recruiters are so well camouflaged, and so \"friendly and helpful\" with their visible advice, and convincing in their invisible PMs (personal messages) that they can go undetected for years. At ESLCafe they are obvious and at reddit they were caught back in 2016 https://www.opnlttr.com/letter/reddit-m ... l-teachers.\n\nThey will always be with us, because when one gets caught, either another will quickly activate and take their place, or they will just create a new user account and start the game all over again. Newbies will always learn their les"
      },
      {
        "author": "Unread post\n by Tiger » 16 Apr 2021, 01:55",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Tiger » 16 Apr 2021, 01:55\n\nThanks for bringing this to our attention. I will now just ignore anything that guy posts here. I was curious why he was always promoting the public schools of China and how wonderful it was to work in Mongolia. I now understand what he is trying to accomplish.\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      },
      {
        "author": "Unread post\n by John V55 » 16 Apr 2021, 09:23",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by John V55 » 16 Apr 2021, 09:23\n\nTiger wrote: \n16 Apr 2021, 01:55\nThanks for bringing this to our attention. I will now just ignore anything that guy posts here. I was curious why he was always promoting the public schools of China and how wonderful it was to work in Mongolia. I now understand what he is trying to accomplish.\nI’ve never said that anyone should listen to what I say. I just offer an opinion and don’t use click baits to promote the opinions of others. I suppose we can all learn from veterans, but young people who have already been scammed are hardly ones to offer advice.\n\nI personally enjoyed Mongolia, but agree it’s not to everyone’s taste. I do promote state schools because I’d hate to see the unsuspecting go down the same scam ridden path you lot have gone down. Having said that, I suppose at your scammy bottom end of TEFL you would need to be on red alert.\nPersonal politic"
      },
      {
        "author": "Unread post\n by Cricket » 16 Apr 2021, 14:35",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Cricket » 16 Apr 2021, 14:35\n\n\n\nIsn't it odd that John has been asked about five times when was the last year he actually taught in China and he just stays mum about that? Going back through his posts five years, I see that he has been posting his resume. I don't discriminate against age, but things change a lot in five years, especially government requirements, and COVID salaries, and this guy keeps preaching to everyone as if he is the reigning expert on China TEFL affairs and he may have been out of the country for years, like the former manager of Dell English who was deported for tax fraud 15 years ago and also now recruits TEFL teachers online for China as if he is still in the game. Thus are the deceptions of online recruiters. BTW... China will not give you a work visa after age 60 unless you own your own business and have a minimum of 10 Chinese employees.\n\nJohn has given some go"
      },
      {
        "author": "Unread post\n by John V55 » 16 Apr 2021, 22:54",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by John V55 » 16 Apr 2021, 22:54\n\nI’ve already told you several times. I taught right up to the end of my leaving which was January 2018.\n\nWrong information as usual. You can’t get a new visa after 60, but if you’re at a school and both parties agree, you can keep working up until around 64/65. Anyway, having been outed as a member of CFTU by CFTU themselves, what’s it like being a volunteer spammer then? No seriously, do you get paid for it or do they tell you what to write? How does it work?\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by Vagabond » 17 Apr 2021, 02:29",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Vagabond » 17 Apr 2021, 02:29\n\n\n\nI am sorry John, but there is nothing in the Labor Laws of China that allows anyone over 60 years of age to teach for a public or private school, so whatever \"arrangements\" you are talking about would be illega Also unless you had one of the new 10 year visa before you turned 60, there is no way, as you said yourself, that you would get a new visa at age 30, although I believe you could always come back as a tourist at any age.\n\nHaving said that, I know a couple ages 67 and 62 who run their own Montessori in China but they have their own registered WOFE and by owning their own company in China they get around the age limits. And for the record I am against age-discrimination because people like yourself who are obviously sharp as a tack with all your mental faculties have the most valuable teaching experience the youngsters won't have for years. Hopefully "
      },
      {
        "author": "Unread post\n by John V55 » 17 Apr 2021, 07:12",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by John V55 » 17 Apr 2021, 07:12\n\nIt is not the labour law you’re under in China, it’s the immigration law that decides whether you go or stay. The Labour law is only concerned with your employment conditions, not your residency or SAFEA working ‘blue book.’ I left in January 2018 approaching the age of 63 after a hint that it was time to start thinking about retirement. I would hardly have been working illegally with the permission of SAFEA. It is true that after the age of 60 you will not get a new job, but not that the current age limit can’t be extended for a short period of time if you’re currently already in employment.\n\nI suppose I could have left and sneaked back into the underworld of scammy language centres and the like, but I’m not that desperate and chose not to go down that road … I’m against age discrimination, but accept the laws and conditions of the country I’m in.\nPersonal "
      },
      {
        "author": "Unread post\n by Blue Moon » 21 Apr 2021, 15:10",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Blue Moon » 21 Apr 2021, 15:10\n\nPersonally I think older teachers are the best because they have the most experience - assuming they are not having medical issues that impair them mentally. Looking back over my life, my own favorite teachers were the oldest ones who had the most patience and genuine concern for me and my learning process.\nWatch your step in China. There is a pile of shit waiting for your foot around every corner that only laowai seem to step in. See https://reddit.com/r/workabroadfraud."
      },
      {
        "author": "Unread post\n by Prometheus » 31 Oct 2021, 19:10",
        "content": "Re: A Warning about TEFL Forum Recruiter Moles and their stealth methods...\nQuote\n\nUnread post\n by Prometheus » 31 Oct 2021, 19:10\n\nThese moles seem to me multiplying all over the internet and they have taken it it to the next level. Now they post a really great job ad that links to their forum that will give their own mobile number which is presented as number for an HR director at a famous international school or university. They will keep up the disguise until after they get your resume, passport scan, and then a Skype interview. All this and then they will tell you that a more qualified candidate was hired. But a few days later they will call you back and refer you to another \"great job\" where they get paid a great placement fee. You will never know you were set up right from the beginning!\nThe best TEFL advice I ever got is at https://reddit.com/r/tefl_tips_traps_scams and right here at TEFL.net."
      }
    ],
    "num_posts": 12
  },
  {
    "title": "TEFL Job Scams - We don't know what we don't know...",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=9048",
    "posts": [
      {
        "author": "Unread post\n by Atlas » 18 Apr 2021, 03:36",
        "content": "TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Atlas » 18 Apr 2021, 03:36\n\nDoes your TEFL career sometimes feel like a mystery maze?\n\n\n\nThis \"interesting\" article post was forwarded to me by ChinaScamWatch.org today and I thought it was worth sharing with all of you, because it shows how little we all know about the TEFL job market and the people that manipulate it, and not for the better IMO. Maybe you will disagree, but I think not. https://abroadreviews.com/china-tefl-jo ... ams-reddit\nLook Before You Leap at https://reddit.com/r/teflscams"
      },
      {
        "author": "Unread post\n by Vagabond » 19 Apr 2021, 18:43",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Vagabond » 19 Apr 2021, 18:43\n\nA very useful post Atlas - Thanks. I would urge all TEFL teachers to bookmark this link, because sooner or later it will come in handy.\n\n\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by Cricket » 20 Apr 2021, 15:05",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Cricket » 20 Apr 2021, 15:05\n\n\n\nI suggest that every newbie TEFL teacher do three things immediately...\n\n- 1 - Get an read the CTA's TEFL IN CHINA FOR DUMMIES AND NEWBIES (They will send you a free pdf copy upon request)\n\n- 2 - Visit and read here https://opnlttr.com/letter/china-esl-te ... am-artists\n\n- 3 - Visit and read: https://reddit.com/r/TEFL_tips_traps_scams\n\nI think if you just do these three things, you will never have to worry about being scammed in China. Almost everyone gets cheated their first year in China (including myself). But I adopted and used the above as my own personal guide after I went to China Scam Patrol workshop in Beijing, and I have not been scammed since.\nBefore sending off your resume or passport scan, be sure to check https://reddit.com/r/teflscams and to vaccinate yourself against foreign teacher job scams."
      },
      {
        "author": "Unread post\n by Blue Moon » 21 Apr 2021, 13:52",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Blue Moon » 21 Apr 2021, 13:52\n\nThanks for the excellent advice. You know, about six months ago I got a PM on my Reddit account from a 9 year user with a verified account that said\n\n\"INew 2021 TEFL Salary charts - don't get low-balled - Ignore the salary quotes of recruiters which will always low-ball you. Get realistic salary charts for 2021 at r/ChinaTeachers or r/TEFL_TIPS_TRAPS_SCAMS which are subs not run by recruiters who recruit with PMs\n\nhttps://opnlttr.com/letter/reddit-mods- ... l-teachers \"\n\nI was curious why I would get such a message, but I checked it out anyway, and then it hit me... TEFL teacher job applicants are just like American voters -- they are only told what other people want them to hear and so much important stuff is being hidden or censored. I then began reading posts here at TEFL.net and only found one liar/recruiter and mostly a bunch of honest teachers so I dropped out of reddit"
      },
      {
        "author": "Unread post\n by Tiger » 22 Apr 2021, 19:54",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Tiger » 22 Apr 2021, 19:54\n\nThe more I really think about it, I guess we really should not have very high expectations of anything in China - especially honesty. I read a while ago that more than 75% of the IP cases in the WTO and World Court involve the Chinese. If they drop these high salaries when they open up for the Olympics, I am outta here.\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      },
      {
        "author": "Unread post\n by Prometheus » 30 Apr 2021, 23:18",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Prometheus » 30 Apr 2021, 23:18\n\nIt is very easy to spot a fake or shady employer in China. If they cannot send you a high-resolution color scan of their SAIC business license and SAFEA registration like those below (not a photocopy or low-resolution scan which are easily photo-shopped) they are undoubtedly a scam and you should not send them your resume or passport scan.\n\n\n\n\n\nGet more details at https://reddit.com/r/ChinaScamCentral\n\nand also https://reddit.com/r/TEFL_tips_traps_scams\nThe best TEFL advice I ever got is at https://reddit.com/r/tefl_tips_traps_scams and right here at TEFL.net."
      },
      {
        "author": "Unread post\n by Tiger » 20 May 2021, 16:22",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Tiger » 20 May 2021, 16:22\n\nI been reading at two other TEFL forums I also visit and saw a quote from Steve Jobs that caught my attention \"There are two ways to learn in this world. We either learn from the mistakes of others, or we learn the hard and costly way\"\n\nSo far, from what I see in China, most expats learn their lessons \"the hard and costly way\". As for me, I refuse to make the same mistakes twice and now I use this link and go the DIY route. https://www.slideshare.net/LaowaiCareer ... -employers\n\n\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      },
      {
        "author": "Unread post\n by Tiger » 08 Oct 2021, 22:41",
        "content": "Re: TEFL Job Scams - We don't know what we don't know...\nQuote\n\nUnread post\n by Tiger » 08 Oct 2021, 22:41\n\nTEFL careers abroad can be lot of fun - even a great adventure - if you can avoid the minefield of scams imo\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      }
    ],
    "num_posts": 8
  },
  {
    "title": "PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=8998",
    "posts": [
      {
        "author": "Unread post\n by Cricket » 14 Mar 2021, 18:15",
        "content": "PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Cricket » 14 Mar 2021, 18:15\n\n\n\nTaken from CSP Report No, 372: (Excerpt)\n\nURGENT RED ALERT! - Do not send nor upload your resume to HiredInChina.com which has been operating illegally since 2018 in Beijing, China and owned by a Chinese CCP member Zhe Jiang. They have refused to provide any reply to our inquiries (The standard 7 questions we ask all suspected scam operated listed here https://opnlttr.com/letter/china-esl-te ... am-artists . Furthermore SAFEA confirmed that both HiredinChina nor Zhe Jiang are not registered nor authorized to solicit nor hire foreigners for any profession in China.\n\nTheir claims to be \"partners with China's Ministry of Education\" are false. We have investigated the positions advertised on their website via 5 mystery teachers and only after they submitted their false resumes were they told that every position they applied for was \"already filled\""
      },
      {
        "author": "Unread post\n by Atlas » 23 Mar 2021, 00:11",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Atlas » 23 Mar 2021, 00:11\n\nMore has come out at https://reddit.com/r/teflreviews and two Chinese brothers named Wong are running the show and they are using some foreign agents in the U.K. to make things appear they are a foreign operation. They are using .com, .org. and .net. So teachers should avoid any and all HiredInChina websites and ads.\n\n\nLook Before You Leap at https://reddit.com/r/teflscams"
      },
      {
        "author": "Unread post\n by Prometheus » 25 Mar 2021, 19:59",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Prometheus » 25 Mar 2021, 19:59\n\nThere is a lot more about these brothers and their gang of agents at https://reddit.com/r/chinascamcentral. These agents are spread around the U.K. and also Serbia, South Africa, and the Ukraine. It seems they set up a \"feeder network\". But I searched the SAIC database and they have no business license and Crystal at SAFEA says they are not registered with them, and therefore, not legitimate. She said she will have the cops add them to the list for \"investigation and roll-up\". Crystal said they \"roll up\" these fake companies every month and she is happy for the COVID border lock up because it cut her paper work by more than half! They are using three different web sites at .com, .org, and .net.\nThe best TEFL advice I ever got is at https://reddit.com/r/tefl_tips_traps_scams and right here at TEFL.net."
      },
      {
        "author": "Unread post\n by Blue Moon » 26 Mar 2021, 14:16",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Blue Moon » 26 Mar 2021, 14:16\n\nA few years ago I had an identity theft problem that took me over a year to clean up with the help of a $5,000 lawyer. My almost perfect credit was destroyed by some yahoo in YiWu, China and I have never been there in my life. I spent less than an hour on the phone with Scott at China Scam Patrol in Beijing and we figured out that someone working at the Beijinger.com was selling the information of expats attending their job fairs sold me data to a professional fraud master whose speciality was identity thief.\n\nThat guy in YiWu bought over $12,000 of electronics, clothes, and jewelry before I learned the police were looking for ME! Thank god I was not responsible for all the charges, but I had to eat the $5,000 legal fee. I hope you all learn from my mistake and use an deliberately misspelled resume. Here is the tip sheet the CSP gave me...."
      },
      {
        "author": "Unread post\n by Vagabond » 27 Mar 2021, 18:51",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Vagabond » 27 Mar 2021, 18:51\n\n\n\nAs for me, in over 8 years, I have never known the China Scam Patrol to be wrong when they issue a report. Here are a few of their most famous ones and I think you will see what I mean... https://ChinaScamPatrol.wordpress.com Of course, you should be your own judge and use your own brain.\nBefore taking any teaching job in China make a quick visit over to https://reddit.com/r/ChinaScamCentral and https://reddit.com/r/TEFLreviews so your dream job does not become a nightmare."
      },
      {
        "author": "Unread post\n by Tiger » 01 Apr 2021, 16:23",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Tiger » 01 Apr 2021, 16:23\n\nWell, Crystal at SAFEA says they are not registered or known to SAFEA and an online search of the SAIC database shows they do not have a business license. I did find them at https://reddit.com/r/teflscams. Draw your own conclusions.\nI suggest every TEFL teacher take a visit to https://reddit.com/r/TEFLscams BEFORE they send off their resumes."
      },
      {
        "author": "Unread post\n by Cricket » 23 Jun 2021, 22:32",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Cricket » 23 Jun 2021, 22:32\n\nThey are also using .org and .net websites as well and have been advertising under numerous fictitious names online. Beware!\nBefore sending off your resume or passport scan, be sure to check https://reddit.com/r/teflscams and to vaccinate yourself against foreign teacher job scams."
      },
      {
        "author": "Unread post\n by Prometheus » 04 Oct 2021, 15:42",
        "content": "Re: PSA Fraud Warning - HiredInChina.com is a Chinese Scam - Linked To Identity Theft by CSP\nQuote\n\nUnread post\n by Prometheus » 04 Oct 2021, 15:42\n\nI heard recent rumors that these guys are now using a bunch of phony names to bait newbies so when they try to do some due diligence, they simply do not show up anywhere online. Here are three alias names I was told they are using for online job ads:\n\nChina Rainbow English\n\nRainbow English\n\nChina TEFL Center\n\nAre there more? If so, please post them here. Thanks\nThe best TEFL advice I ever got is at https://reddit.com/r/tefl_tips_traps_scams and right here at TEFL.net."
      }
    ],
    "num_posts": 8
  },
  {
    "title": "The truth behind scam links",
    "url": "https://www.tefl.net/forums/./viewtopic.php?t=7875",
    "posts": [
      {
        "author": "Unread post\n by John V55 » 26 Sep 2017, 10:21",
        "content": "The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 26 Sep 2017, 10:21\n\nFor those new to TEFL in China, one fact remains undisputed. For the unwary, China is a disaster waiting to happen!\n\nThere are no end to the scams available and often those pretending to help (and that includes foreigners) are the biggest culprits. Where do you want to start? Chinese Foreign Teachers Union (CFTU)? Reddit, Scam Busters? China Scam patrol? China Scam Central? … Take your pick, because although claiming to be independent, if you look closely, they’re all interlinked. That’s not to say there might not be altruistic motives behind some of these volunteers that do the link posting, but just as the sites they’re pointing you to, you’ll never find out who they are either.\nTo be fair, there’s is good information on these sites sometimes, but that’s to draw you in.\n\nYou’re new right? How does 20, or 30,000 Yuan a month sound, plus all the perks? Twenty thousand Yuan is the equivalent of $3000, or 2"
      },
      {
        "author": "Unread post\n by Josef Essberger » 26 Sep 2017, 15:02",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Josef Essberger » 26 Sep 2017, 15:02\n\nAlways good to see a post with actual content\n\"We are not wholly bad or good, who live our lives under Milk Wood :? \" — Dylan Thomas, Under Milk Wood\n\neBooks: English Prepositions List | Essential Business Words | Learn English in Seven"
      },
      {
        "author": "Unread post\n by John V55 » 27 Sep 2017, 04:47",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 27 Sep 2017, 04:47\n\nThanks Joe. I feel sorry for the younger ones who are told to focus on salary amounts. Wherever you come from, China is a long way from home and it’s a nail biting time. On the one hand you’ve got the lure of adventure and excitement, yet on the other the two legged sharks are queuing up to pounce on the unwary.\n\nYou’re worth more than that!\n\nThe higher salary you expect and the higher amount you’re told by others you deserve, the more likely you are to be scammed, until eventually you end up in the murky world of, \"We have hundreds of jobs available (but we’re not telling you where); at 20,000 a month (no TEFL cert’ or degree required).\"! No state school would ever pay that, because unless you had a Ph.D in education, you’re simply not worth it and that’s the bottom line. Those sort of ‘private’ school ads is where the scams occur and the deported frauds come from.\n\n\"Five vacancies for performing for"
      },
      {
        "author": "Unread post\n by Murphy » 28 Sep 2017, 03:24",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Murphy » 28 Sep 2017, 03:24\n\nI think everybody see things from different points of view John. I have taught in China now almost a decade now and almost every newbie teacher I meet complains about being ripped off or exploited by their own recruiter or employer. The veteran teachers do not seem to have this problem because they have learned their lessons from personal experience and the help of other teachers, not their employers nor their recruiters.\n\nFor example, not one employer of the 5 I have had in 9.5 years nor my original recruiter (name unimportant) ever once told me about the employee rights I had that protected me against exploitation, unpaid overtime, or prevented my employer from using me as a marketing monkey. I found out for free from a CFTU newsletter that I got for free and then three years later I found this post confirming that indeed all expat employees in China have rights. http://opnlttr.com/letter/15-employee-"
      },
      {
        "author": "Unread post\n by John V55 » 28 Sep 2017, 04:41",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 28 Sep 2017, 04:41\n\nCome on Murph, you’re slipping. Only three spammy links out in a post of this size? :)\n\nOf course nearly every newbie teacher at the level of school you’re in is complaining and will continue to while they’re drawn into the greed you promote. The greed that has kept you school hopping for nearly a decade and five jobs?\nNo one told you your obligations and rights? They were in the contract you signed and if you agreed to disregard it and be used, you can’t blame the employer. The rights you have are in your contract, not what CFTU or an open letter tell you they should be.\nNo Murph, what I said about the CFTU is that they sometimes posted good information to draw people in and by receiving their newsletter, you’re almost definitely on the PSB radar yourself. You see Murph, I can explain without the need to resort to the same type of continual links, over and over and over again, because no one is pulli"
      },
      {
        "author": "Unread post\n by Murphy » 28 Sep 2017, 05:03",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Murphy » 28 Sep 2017, 05:03\n\nI read where you said recruiters should take 7,000 a month from a teacher's salary which is about $1,000 per month or $12,000 a year. That is outrageous John. Most professional headhunters only take one month's salary as their fee. I agree they should not work for free but your 7,000 per month suggestion is exorbitant and shameful IMO.\n\nAnd stop the BS about trying to smear everyone who disagrees with you as some secret member of the CFTU. Maybe just maybe you can somehow accept the possibility that you can be wrong about something once in a while ????? So far, anyone who disagrees with you and posts a link to support their reasons is a member of some cabal and you always call the links spam, even those that originated with the largest English newspaper in China (China Daily) and the Huffington Post!\n\nI will forever disagree with your salary claims and the advice to use job recruiters in China. I cite t"
      },
      {
        "author": "Unread post\n by John V55 » 28 Sep 2017, 05:35",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 28 Sep 2017, 05:35\n\nNo, I didn’t say they should take, I said they do take. It’s why there’s so much competition between them. Who’s going to bend over backwards and even break the law for a one off 7,000 fee.\n\nMost of you have already admitted previous involvement with the CFTU and you personally get the newsletter, but of course, despite all the links, you’re unbiased, right?\n\nI’ve never disputed a DIY approach, what I dispute is the greed you promote by the links you post to. It doesn’t matter whether it’s a recruiter or school, your constant fixation about money means you’ll always be a target and always have problems.\n\nMurph, stop and think for a moment. ‘Me, affiliated to CFTU? Just because I endlessly post to spam links, get their news letter and tell everyone one they’re being cheated?’ Yes Murph, something like that. It’s so obvious it’s embarrassing. Do you think is only this site that experiences this? You vol"
      },
      {
        "author": "Unread post\n by John V55 » 28 Sep 2017, 10:39",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 28 Sep 2017, 10:39\n\nI’d like to think your individually misguided, but when I see a handful of you engaged in exactly the same sort of behaviour, at the same time, replicated across the Internet, I know where it’s coming from. You think you’re the only ones? ‘Hey guys, I just discovered a great site and this one, oh and another one and wow look at this one …’ with links in every post, pointing towards Reddit, open letter, the various scam buster ones and the CFTU, all with the same agenda behind them? Do you really think anyone believes a bunch of identical and anonymous spam linkers?\n\nBy the way Murph, you are aware that the company you say you work for and doing great on your 30K a month, ‘New Oriental’ is itself on a TEFL blacklist? You must realise that your 30K means your employer is actually paying around $72,000 a year with the extra add-ons for a TEFL teacher in China? Are you having a laugh? :lol: Yet there agai"
      },
      {
        "author": "Unread post\n by Murphy » 28 Sep 2017, 14:41",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Murphy » 28 Sep 2017, 14:41\n\nJohn, to be crystal clear there is nobody \"behind\" me and nobody in front of me or even beside me other than my wife. I speak for myself and only myself. Your CFTU conspiracy drumbeat is getting stale and annoying. But at least we both agree that the DIY route is the best way to go in China. Btw... I found this 2017 China blacklist at http://reddit.com/r/Tefl_tips_traps_scams and I think it is worth sharing https://www.slideshare.net/LaowaiCareer ... l-teachers\n\nLast but not least, this is what most of my colleagues use to avoid stepping in China's foulest shit and surprise - it has nothing to do with your beloved CFTU John... https://www.scam.com/showthread.php?704 ... -BLACKLIST"
      },
      {
        "author": "Unread post\n by John V55 » 29 Sep 2017, 00:04",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 29 Sep 2017, 00:04\n\nWell no, we don’t necessarily agree. There are both good and bad recruiters, but yes, at the private bottom tier of private ‘school’ TEFL, there are probably more bad ones than good ones and it’s where the scams, the fraud and deportations come from. That’s not rocket science. It’s less to do with ‘schools’ and recruiters than it is to do with personal greed.\n\nLet’s cut out the middleman of scambusters, open letters, anonymous volunteer posters and go directly to the man himself. Enter the CFTU main page and having only got half way down, I already spot inaccuracies.\nLet’s forget that, so that it’s available to those that have worked elsewhere and know it’s rubbish. We read on and discover the main page is a replica of all the other links, but yes we know that, they’ve been placed there by the same people, so that’s not a surprise. So what’s the underlying point. Join our union, get our newsletter. We"
      },
      {
        "author": "Unread post\n by John V55 » 29 Sep 2017, 03:49",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 29 Sep 2017, 03:49\n\nP.S\n‘Last but not least, this is what most of my colleagues use to avoid stepping in China's foulest shit and surprise - it has nothing to do with your beloved CFTU John... showthread.php?704 ... -BLACKLIST’\n\n‘You can get the complete blacklist maintained by the CFTU which is updated every three months here chinaforeignteachersunion.org.’\n\nOf course it does, why lie Murph, the link is there a quarter down the page, with exactly all the other scam buster links you few are pointing to! Dishonesty and preying on potential new arrivals before they even get here, anonymously boasting of fantastic salaries in blacklisted schools, whilst trying to reel people in to your agenda … the sooner they clear you scam linking vultures out the better! :)\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by Murphy » 29 Sep 2017, 07:22",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Murphy » 29 Sep 2017, 07:22\n\nJohn, that old TEFL Blacklist link you gave goes back to 2007 and the CFTU was not even born then so I don't see how you can link one to the other. Personally I prefer the reddit format where anyone can chime in and have there say and when 80% of people agree on something, and I see no \"removed\" editing from mods, I can safely assume they know what they are talking about. Here are three examples of what I mean;\n\nhttps://www.reddit.com/r/ChinaScamCentr ... _esl_tefl/\n\nhttps://www.reddit.com/r/ChinaScamCentr ... ftu_china/\n\nhttps://www.reddit.com/r/ChinaTEFL/comm ... ruiter_is/\n\nAnd please stop your ad-hominem attacks where you keep suggesting and outright saying I am part of the CFTU. I told you twice that I am not a member, never was and never will be. How can I make it more clear to you? Are you calling me a liar John?\n\nYou warn people not to read scam warnings yet you admit China is full of scams. WTF"
      },
      {
        "author": "Unread post\n by John V55 » 29 Sep 2017, 09:05",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 29 Sep 2017, 09:05\n\n'With that I’ve had my say and realise that the more I post about this, the more it gives you lot an opportunity to include further spam links.'\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by Murphy » 30 Sep 2017, 01:26",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Murphy » 30 Sep 2017, 01:26\n\nOkay John, I amicably agree to disagree with you and maintain that anyone coming to visit, live, or work in China needs to be keenly aware that ALL foreigners are targets of many China scam artists especially expats that work in China. I do not have a website as my signature line so I will just leave this last link for the benefit of anyone planning on coming to China... https://www.scam.com/showthread.php?704 ... -BLACKLIST Stay well John and give Mongolia my best regards. I really miss the beef and milk candy from there!"
      },
      {
        "author": "Unread post\n by Cricket » 04 Feb 2021, 03:22",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Cricket » 04 Feb 2021, 03:22\n\n\n\nAs I just finished explaining to you in another post John, all foreign teachers teaching around the globe, and especially the newbies in China have a right to be warned of the dozens of scammers that are targeting them for many different clever frauds that can not only be costly, but can leave an expat stranded and broke over a thousand miles from home. I guess you never read the story of teacher Cox about 6 years ago when Rebecca from China ESL skimmed 60% of her salary? Here is the horrible contract that let it happen. https://www.reddit.com/r/TeflReviews/co ... gn_hr_aka/ That same Rebecca got over 1,200 foreign teachers arrested and deported by letting them work with out a Z visa and even selling them fake university degrees and phony TEFL certificates, and even bogus police certificates!\n\nTell me honestly John, You would not want to warn the newbies about these scams and just let them get ripped"
      },
      {
        "author": "Unread post\n by Vagabond » 04 Feb 2021, 05:18",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Vagabond » 04 Feb 2021, 05:18\n\nYou guys keep arguing all you want. For me I don't use job agents any more and get my own gigs now and my pay has doubled. But when I did use recruiters and job agents in the past, I also used just one link which is a list of 7 questions to always ask. If they could not answer the 7 questions I just hung up the phone https://www.realscam.com/f51/fraud-warn ... live-4799/\n\nNo, I will never work foe the peanuts paid by China's public school system. I didn't travel 4,500 miles to China to struggle to make ends meet. I like my steak and beer and night out with my friends and don't want to live with three roommates Thank you. I now earn over 20,000 rmb after taxes and my only roommate is my partner. We have satellite TV with 210 English channels, and take Chinese lessons once a week. I negotiated my free furnished apartment because I was willing to sign a two year contract - only because this training cent"
      },
      {
        "author": "Unread post\n by John V55 » 04 Feb 2021, 09:09",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 04 Feb 2021, 09:09\n\nYou know who you are. Keep those link farm site links flowing?\nhttps://en.wikipedia.org/wiki/Link_farm\n\nA polite warning. If I find this post is losing Google authority because of its external spam links, I’ll rewrite the content as an article and put it on a very authoritative site that you’re unable to comment on and link your spam sites out of. :)\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by Cricket » 04 Feb 2021, 20:21",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Cricket » 04 Feb 2021, 20:21\n\n\n\nI'm sorry John, but you now just convinced me that you must be using this forum to recruit newbies because you get all upset every time someone tells them they can earn more money SAFELY without having to settle for the low pay of public schools which YOU keep promoting. And as I mentioned before, you have been promoting yourself with your resume in over 200 posts and counting. Most people would consider this to be spamming.\n\nI myself once taught at public high school at Beijing No. 19 in Haidian, and I could not wait for my contract to end as I was always counting my money and hoping I had enough left to eat by the end of the month! And yes, I too love Mongolia (in the summertime!) but every TEFL teacher deserves to know the truth about the REAL salaries of TEFL teachers in China and not just what recruiters and job agents want them to think John. This is an international link and has nothing to do "
      },
      {
        "author": "Unread post\n by John V55 » 04 Feb 2021, 22:25",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by John V55 » 04 Feb 2021, 22:25\n\nI feel no need to be drawn into defending myself as I only link out to my own work and reputable sites and have no single agenda. You can’t trash my reputation, because I’m independent, not a recruiter or affiliated with any organization. But I know who’s behind you. ;)\n\nFair enough, I will now go and spend time writing a full blown essay on TEFL and scams which will include warnings about the organization behind you and the link farm spam sites you’re linking out to which I will then distribute around my own preferred high authority sites. No hard feelings anonymous Cricket. I don’t particularly care and I suspect neither do you, but I’ll bet the organization you’re spamming for won’t be pleased. Good luck and take care. :)\nPersonal political satire blog: https://johnvasiateacherblog.forumotion.com"
      },
      {
        "author": "Unread post\n by Atlas » 04 Feb 2021, 23:49",
        "content": "Re: The truth behind scam links\nQuote\n\nUnread post\n by Atlas » 04 Feb 2021, 23:49\n\nI ain't taking sides here but what makes you think someone who posts links to support what they say is representing someone other than themselves? You both made valid points about working safely and avoiding scams but each of you uses different ways to accomplish the same goal. Mr. John prefers to sacrifice the extra income to work inside the protective moat of public schools. Mr Cricket prefers the higher income and made his way through the minefield using the warnings of others. You both succeeded. Kudos to both of you. In my judgement there is always more than one way to skin a cat as my grandpa always told me.\n\nI don't see anything wrong with posting external links (so long as they relate to the subject debated and not some sort of advertising) and I don't see anything wrong with a user putting his resume in his online signature. I also suggest that if some mystery organization had something importan"
      }
    ],
    "num_posts": 20
  }
]